{
  "message_id": "19a59c7c5fdecde4",
  "chunked_at": "2025-12-08T14:29:02.472216",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19a59c7c5fdecde4_email_0_042ad7fe",
      "text": "Dear Students, We hope you are enjoying your winter and you and your families are staying safe. We have some important dates and information to share with you for Spring 2026: January 14, 2026: Spring 2026 Tuition Payment Deadline January 20, 2026: First day of Spring 2026 classes February 2, 2026 by 11:59PM: Last day to add/drop/swap without a W on your transcript and 100% refund February 3, 2026 (midnight): Any drop will result in a W on the transcript and no refund. All waitlists are purged. February 10, 2026: Last day to waive/Enroll in NYU Health Insurance February 15, 2026: Last day apply for May 2026 Graduation March 16 - 20, 2026: Spring break: no classes scheduled April 14, 2026: Internal Deadline to submit pass/fail or withdrawal request to your advisor (to allow time for processing) April 17, 2026: Last day to request a pass/fail or withdraw from a class with a W and no refund. Final university deadline - No extensions. May 5, 2026: Last Day of Classes May 6, 2026: Reading Day May 7 - 13, 2026: Final Exam Period (consult faculty for exact dates and confirmation) May 14, 2026: All-University Commencement and Spring 2026 Degree Conferrals May 18, 2026: First day of Summer 2026 classes Useful Links: Spring 2026 Tentative Final Exam Schedule Spring 2026 Graduate Course Schedule NYU Academic Calendar Contact the Office of the Bursar regarding billing, payments and refunds. Enroll or Waive Health Insurance: Deadline February 10th All students are automatically enrolled in the NYU student health insurance.  If you have an equivalent health insurance already, you may apply to waive your insurance by February 10th. The Insurance Office will need to approve your waiver so don't wait until the last minute. https://www.nyu.edu/students/health-and-wellness/student-health-insurance/washington-square-students.html International Students in the USA must enroll full-time International students who are in the USA must enroll full-time (9 credits). If it is your last semester and you have less than 9 credits to take, you may apply for a reduced courseload via OGS . International students are also required to take at least one in-person class every semester. If you only have one course to take in your final semester, that course must have an in-person instruction mode . Waitlists are purged at midnight on February 3rd Please check your waitlist status and make sure you set up a swap and do not have time conflicts if you see the class open but you are stuck on the waitlist. All waitlists are purged at midnight on February 3rd. Please enroll in a backup course. RESERVED SEATS : Some seats are reserved for students in other programs and appear open. Please add yourself to the waitlist and set up and Edit Swap or the best chance to get a seat once they are released. They may appear “open” but actually have a long waitlist for seats that are currently reserved. Questions? Contact your advisor: Last Name, A-M, Betty Tsang, betty.tsang@nyu.edu Last Name, N-Z, Cristina Domingo, cdomingo@cs.nyu.edu Graduate Team: graduate@cs.nyu.edu https://t.e2ma.net/optout/v61vzr/j939hwjc?s=9YXurEKrnyU0O5pUJNFY1sBJP6x0bWzFPbFUWL1c4nU",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19a59c7c5fdecde4",
        "from": "NYU Department of Computer Science <graduate.cs.nyu.edu@jhefb.e2ma.net>",
        "to": [],
        "subject": "Spring 2026 Important Dates",
        "date": "Thu, 06 Nov 2025 15:27:27 -0000",
        "timestamp": 1762460847,
        "token_count": 789
      }
    }
  ]
}