{
  "message_id": "19a7df6d055312d4",
  "chunked_at": "2025-12-08T14:30:41.816630",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19a7df6d055312d4_email_0_9de03466",
      "text": "Dear MSCS students, Registration for Computer Science courses for the Spring 2026 semester will begin the week of November 17, 2025. Your actual registration appointment will vary. Check Albert for your registration appointment day/time. The Spring 2026 Computer Science graduate schedule can be found here . The course schedule is subject to change as the department finalizes the schedule. For this registration period, your advisor hold will be automatically removed before the start of registration week. There is nothing you need to do on your end for this to happen. If you are on academic probation for the Fall 2025 semester, please email your advisor to ensure you are registering for the proper coursework. You can check the MSCS Degree Requirements , and refer to the requirements form for the 30-credit program here and 36-credit program with concentration here . The day that you can begin registering is determined by how many credits you have earned at the time of registration. This does not include pending credits from this Fall 2025 semester. You may begin registering at 7:00am on your registration day. Your appointment date can also be found in Albert. The appointment dates are as follows: Registration Date                                       Number of earned credits 1st day, November 17th                                27 earned credits or more 2nd day, November 18th                               18-26 earned credits 3rd day, November 19th                                9-17 earned credits 4th day, November 201st                               0-8 earned credits WAITLISTS and SWAPS: Students are strongly encouraged to register early on their registration appointment day and to wait list for any courses that may be full. If you wait list for a class, you need to set up a swap option for your waitlisted course. Otherwise, the waitlist may skip over you. RESERVED SEATS: Some courses that have \"reserved seats\" for students in other programs. Add yourself to the waitlist to get the next available seat when the seats are released. ACADEMIC POLICY: Students must maintain a minimum cumulative GPA of 3.0 or higher and must also successfully complete at least 66% of credits attempted to be considered in good standing. To calculate your rate of completion, take your earned credits ÷ attempted credits = % Rate of Completion. Credits attempted means being enrolled in a course, but have not received a grade yet (an F or W are also considered attempted credits). Completed or earned credits are courses in which grades have already been posted. CHECK YOUR DEGREE PROGRESS: Students can check their degree progress with the Degree Progress Report in Albert. This tool will allow you to track your requirements including your completed and remaining courses, any transfer credits applied towards your degree and your academic standing. If anything looks incorrect or courses are not counted, please contact your advisor. OUTSIDE ELECTIVES POLICY: Any course that is outside of Courant CS, Math or Data Science must be approved by the Director of Graduate Studies to count towards the program. If you are unsure, please check with your advisor. Being able to register for a course does not mean that it is allowed for your program. ONLINE COURSE POLICY: Students are not permitted to take more than a total of 50% of their courses online. Please plan to take no more than 5 courses online in your entire graduate career. International students are only permitted to take up to 4 credits online per semester, and must take at least one in-person course every semester to be in compliance with the student visa. If you have any questions about in-person requirements, please contact the Office of Global Services (OGS) at ogs@nyu.edu . If you are graduating this Fall 2025, please ignore this email. Questions? Contact your advisor. Last Name, A-M, Betty Tsang, betty.tsang@nyu.edu Last Name, N-Z, Cristina Domingo, cdomingo@cs.nyu.edu https://t.e2ma.net/optout/38gj0r/j939hwjc?s=IcYrjjrJ7f7N--X6-rbF9wLnVidgZmk6ofq4ggQqK9I",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19a7df6d055312d4",
        "from": "Computer Science Department <graduate.cs.nyu.edu@jhefb.e2ma.net>",
        "to": [],
        "subject": "IMPORTANT: Spring 2026 Registration Info for MSCS Students",
        "date": "Thu, 13 Nov 2025 16:05:08 -0000",
        "timestamp": 1763067908,
        "token_count": 1013
      }
    }
  ]
}