{
  "message_id": "19a748ca2b55e64d",
  "chunked_at": "2025-12-08T14:30:07.665122",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19a748ca2b55e64d_email_0_ae2a08d3",
      "text": "Dear Students, We wanted to remind you know about some upcoming deadlines: LAST DAY TO WITHDRAW FROM A FALL 2025 CLASS with W and no refund Final Deadline: November 24th, 3PM EST Submit to your advisor by November 19th to allow time to process the request The \"W\" means withdrawal from the course and does not affect your GPA. There is no refund since it is past the refund deadline. Please discuss your plan to withdraw from a class with your advisor. Since each request must be approved by the advisors, do not wait until the last minute. Follow the online instructions to withdraw from a class in Albert. International students should consult with the Office of Global Services if you are currently in the USA before dropping any courses. PASS/FAIL OPTION for FALL 2025 course Final Deadline: November 24th, 3PM EST Submit to your advisor by November 19th to allow time to process the request The pass/fail policy for graduate students in the Department of Computer Science is ONE course pass/fail in your entire graduate career as long as it is not a foundational, required or capstone course. You must apply to take a course pass/fail by November 19th to allow time to process your request. For MSIS students, you must take Fundamental Algorithms and other two of the three options as regular graded courses to be counted as foundational courses: Data Communications and Networks, Database Systems, and Operating Systems. If you choose to take one of these courses as pass/fail, it disqualifies it from being a foundational course and will only be counted as an elective. If you choose the pass/fail option, you cannot undo the request once it has been approved by GSAS. The pass (P) will not affect your GPA but if you fail (F), it will negatively impact your GPA. A passing grade is a C- or higher. The credits for a pass course will count towards your degree requirements. If you fail the course, it will not count towards your degree requirements. Please fill out and send the PASS/FAIL REQUEST FORM (download and fill out form rather than filling it out on the web) to your advisor by November 19th . Send all requests to graduate@cs.nyu.edu . Questions? Contact your advisor. Last Name, A-M, Betty Tsang, betty.tsang@nyu.edu Last Name, N-Z, Cristina Domingo, cdomingo@cs.nyu.edu https://t.e2ma.net/optout/z96c0r/j939hwjc?s=uaqM5LK0F3z6nUbCYtlqjhldIif9YbJC1NsAquSISPA",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19a748ca2b55e64d",
        "from": "NYU Courant Computer Science <graduate.cs.nyu.edu@jhefb.e2ma.net>",
        "to": [],
        "subject": "REMINDER: Fall 2025 Pass/Fail and Withdrawal Deadline: November 19th",
        "date": "Tue, 11 Nov 2025 20:12:41 -0000",
        "timestamp": 1762909961,
        "token_count": 594
      }
    }
  ]
}