{
  "message_id": "19a9336c36e00d26",
  "chunked_at": "2025-12-08T14:31:04.981204",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19a9336c36e00d26_email_0_ffb02be6",
      "text": "Dear Students, If you would like to request a seat in CSCI-GA 3812 Info Tech Projects for the Spring 2026 semester, please fill out this form . MSIS students who are graduating in Spring 2026 will be given first preference for this course, and will be given a permission code after their form submission. All other students, MSIS and MSCS alike, will be put on the wait list. Registration from the wait list is not a guarantee and these students are encouraged to register for an alternate Spring 2026 course just in case. The prerequisites for this course for MSIS students are CS requirement A (Fundamental Algorithms) and CS requirement B (Two out of three of these courses: Data Communications & Networks, Database Systems, Operating Systems). The prerequisites for this course for MSCS students are Fundamental Algorithms, Operating Systems and Programming Languages. For MSCS students in the 36-credit option with concentration, approval depends on the type of project you are working on. Approval is given on a case-by-case basis. Otherwise, please choose an AI specific capstone course from the list. The priority deadline to request a seat in this course is December 11, 2025 . After this date, the instructor will review the wait list and will decide which, if any, students will register off the wait list. This fall, the course is being offered on Wednesdays from 5:00-8:00PM PM Eastern Time in Warren Weaver Hall 312 (may be subject to change). It will be taught by Professor Evan Korth. Questions? Contact your advisor. Last Name, A-M, Betty Tsang, betty.tsang@nyu.edu Last Name, N-Z, Cristina Domingo, cdomingo@cs.nyu.edu Request Seat for ITP https://t.e2ma.net/optout/fqms0r/j939hwjc?s=n1E2ITokN2sPeYMVEEUZj7GfyASCVfq5OX1TL4aX5Ws",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19a9336c36e00d26",
        "from": "Computer Science Department <graduate.cs.nyu.edu@jhefb.e2ma.net>",
        "to": [],
        "subject": "Spring 2026 Info Tech Projects Registration Info and Application",
        "date": "Mon, 17 Nov 2025 19:07:08 -0000",
        "timestamp": 1763424428,
        "token_count": 436
      }
    }
  ]
}