{
  "message_id": "19aa6cdd0959e4fc",
  "chunked_at": "2025-12-08T14:31:42.123059",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19aa6cdd0959e4fc_email_0_51f46406",
      "text": "This email serves as your November 21st, 2025 newsletter for notable professional development and fellowships news at NYU GSAS. Remember you can stay up to date with all upcoming professional development events by subscribing to our Google calendar ! If you have questions about the contents of this newsletter, please contact Abby Williams for Professional Development at gsas.profdev@nyu.edu or Emily Hollenbach for Fellowships & Awards at gsas.fellowships@nyu.edu . Register now! GSAS x Alda Center Ph.D. Communication Workshop Join GSAS for a day-long training led by the Alan Alda Center for Communicating Science, designed for doctoral students in the sciences, social sciences, and humanities on Friday, December 12th from 9:00 AM - 5:00 PM in Hemmerdinger Hall (Silver Center) .  Through this workshop, you will learn to: Share your expertise in ways that resonate with any audience Build meaningful connections and foster community Generate awareness, support, and funding for your work Strengthen \r\ninterdisciplinary collaborations Inspire others to engage with the world around them The Alda Center is located at Stony Brook University and features a team of social scientists and improvisation specialists who use improvisational methods to deliver practical learning experiences.  Using research-backed communication principles and techniques, this workshop will help develop the engagement strategies that work best for you. Participants will receive priority acceptance for Spring 2026 TELL GSAS sessions.  Refreshments and lunch are provided, with breakfast beginning at 8:30 AM. Please RSVP using the form below. Participation is capped at 32 on a first-come, first-served basis, and participants must commit to the full day of training . Register Transferable Skills Across Industries + Industry vs Function Monday, November 24th, 12:30-1:30PM Virtual In this virtual session, you will learn how to identify and communicate transferable skills while exploring the difference between industries and job functions; helping you expand your options and feel confident in your career journey. Register Turn a Paper into a Publication Thursday, December 4th, 3:00-4:30PM Silver Center 104 & Virtual Journal publications represent an essential part of professional academic writing across the social sciences and humanities. This workshop is designed to help you transform a dissertation chapter into a publishable manuscript for a peer-reviewed journal. We will discuss how to develop transferable writing practices and skills for publication and anticipate reviewers’ assessment. Students attending the workshop should have a draft dissertation chapter, one published journal article from a writer in their field that they admire, and a targeted publication. Students will leave the workshop with a cogent plan for journal publication. Register Crafting Your Cover Letter Friday, December 5th, 1:00-2:00PM Silver Center 120 & Virtual Dreading the internship cover letter? In this workshop, you will learn not only the structure of the professional cover letter, but also how to cultivate your personal voice. GSAS Writing Advisors Corey Risinger and Miriam Juarez will share their cover letters and guide you through the process of writing your own. Participants will leave this workshop with a deeper understanding of this application requirement and the tools to confidently pursue diverse internship and job opportunities. Attend this workshop in person or over Zoom. Register Enroll in Spring 2026 Public Humanities Courses! The Spring 2026 Public Humanities curriculum is now available on our website ! There, you will find full descriptions of core curriculum as well as departmental electives approved for completion of the Advanced Certificate in the Public Humanities . Please note the website will continue to be updated when/if any additional courses become eligible. The Case Studies in Public Humanities (PUBHM-1101) course is hands-on and experiential, rather than seminar-based, meaning that you'll get the chance to actively work on real public humanities projects . It is open to all GSAS graduate students and provides an exciting opportunity to get practical experience with public-facing work. This semester, we are excited to offer a new partnership with the Kevorkian Center and a continuation of our existing \r\npartnership with T he Hemispheric Institute : Case Studies in Public Humanities (PUBHM-1101): Public Pedagogies and Policies with the Kevorkian Center In this course, you will work with the Kevorkian Center team to foster public understanding of various world regions, including the Middle East, around issues and challenges of everyday life for people across the globe and in NYC, mainly through public K-12 education and outreach. \r\nCoursework likely involves three project topics – Kevo’s Spring Institute, transforming NYC civic education, and public humanities grant-writing. Case Studies in Public Humanities (PUBHM-1101) : The Hemispheric Institute and HIDVL In this practice-based course you will take up the practice, theory, and politics of archive making through collaborative work on the Hemispheric Institute Digital Video Library (HIDVL), a groundbreaking archive of theater, performance, \r\nart, activism, and scholarship from across the Americas from the 1960s to the present. The seminar will meet weekly for the first 7 sessions to introduce the work, history, and archival tasks at Hemi. After those 7 sessions, your seminar attendance becomes more individualized and flexible, and your projects will guide your schedule. You will work with the Hemi team to help create new HIDVL collections, understand the meaning and making of archives and metadata, contextualize collection videos with metadata and research resources, create profiles for new collections, learn how to conduct an artist interview, create a Research Guide on a subject of your choosing in HIDVL, and conduct a User Experience survey. Spanish, Portuguese, or Kreyòl language skills are helpful but not required. Read about all available courses at the link below, and register on Albert! Read More Resources Beyond the Professoriate Beyond the Professoriate is a professional development tool where doctoral students and postdocs can explore your career options , make informed career decisions , \r\nand learn proven job search strategies . Big Interview Big Interview 's proven, step-by-step system combines expert video lessons and interactive interview practice tools to help students land their dream job. Through this career tool, students will get hands-on practice with mock interviews tailored to their specific industry, job, and experience level. Wasserman Headshot Photo Booth Visit the Headshot Photo Booth at the Wasserman Union Square location anytime the office is open to use the self-service booth. You can even borrow professional clothing from the career closet for your photo! Read more here. LinkedIn Learning NYU provides no-cost access to LinkedIn Learning with thousands of online how-to tutorials taught by real-world professionals covering topics that include technology, business, and creative skills. You'll find tutorials on personal branding, video editing,  Google Sheets, and much more. Focus 2 Career Explore different career options through interactive, online assessments. Reflect on your values, skills, and interests and relate them to possible career paths! Reminder: Use Fellowship Databases! GSAS Fellowships encourages you to view their website . But fellowship databases and guides on our External Resources page can also be helpful! Lafayette Fellowship Benefits: A €1,500 monthly stipend from mid-July 2026 through the end of June 2027 to cover living expenses One year of tuition at a partner French institution for eligible programs Application fee waivers for French academic institutions and master’s programs Student \r\nvisa fee waivers for one academic year A round-trip flight to and from France at the start and end of the program Coverage of travel costs and activities related to the French-American Leadership Program Application Deadline: November 30, 2025 The Lafayette Fellowship is a prestigious new graduate fellowship in France for tomorrow’s leaders. Partnering with 15 of the top French higher education institutions, one year of master’s-level studies are available across science, technology, engineering, and mathematics (STEM); the humanities and social sciences; and the arts, either in French or entirely in \r\nEnglish. In addition to their academic studies, fellows will take part in the French-American Leadership Program, which explores the future of the transatlantic relationship and provides a 360-degree immersion into European innovation, culture, and policy, as well as access to an international network of mentors. Open to: U.S. citizens Applicants who will be under 27 years of age on July 1, 2026 Updated: Possessors of a Bachelor’s degree from a U.S. institution earned \r\nbetween January 2023 and June 2026 3.7 minimum GPA STEM, humanities, social sciences, and arts students interested in addressing global challenges in a French-American context French proficiency not required Read More Apply Now Social Sector Leadership Diversity Fellowship (SSLD) Benefits: Monthly workshops Personalized coaching Retreats Speaker/Panel events Peer and alumni network Application \r\nDeadline: December 7th, 2025 at 11:59 PM ET NYU's Social Sector Leadership Diversity Fellowship (SSLD) is an 18-month leadership development experience for NYU graduate students across all disciplines who are committed to making an impact in the social sector. SSLD provides the skills, support, and community to help you grow your capacity to influence systems, bridge divides, and tackle today’s most pressing social challenges. Fellows join a vibrant, cross-school cohort of NYU changemakers creating lasting change locally, nationally, and globally. Now in its thirteenth year, SSLD alumni have built career paths making social change in every industry they touch; ranging from cybersecurity and public health to food sovereignty and \r\ndisability-inclusive education. Whether you’re refining your leadership style or exploring new ways to drive and grow your impact, SSLD offers a space where you can bring your whole, authentic self —and clarify your purpose and vision for change alongside a supportive peer and alumni network. Open to: Graduate students enrolled for the duration of the 2026-2027 academic year Good academic and disciplinary standing Commitment to public service Read More Apply Now 2026-27 Language Fellowships from the Blakemore Foundation Benefits: Full tuition and stipend for living, travel, and study expenses Application Deadline: December 30th, 2025 at 11:00 PM PST Blakemore Foundation Asian Language Fellowships are awarded for one academic year for the advanced study of Chinese (in Taiwan), Japanese, Korean, \r\nIndonesian, Khmer, Thai, or Vietnamese in Asia. Study of Chinese at Tsinghua University in Beijing is also available as a Blakemore Fellowship. Open to: U.S. citizens or permanent residents Graduate students and young/mid-career professionals planning to use referenced language(s) in their career Have completed at minimum the third year of study of the Asian language, and ready to advance to professional fluency Blakemore Kingfisher Art History Language Fellowships are awarded \r\nfor 9-12 months for study of Chinese or Korean in East Asia, who have a well-demonstrated intent to study the pre-twentieth century history of Chinese or Korean art at the doctoral level. Open to: U.S. and Canadian citizens or permanent residents and foreign nationals studying in U.S. or Canadian colleges Interest in pursuing doctoral degree in pre-twentieth century Chinese or Korean art history Have completed at minimum the second year of study of the Asian language in rigorous college-level language programs Read More Apply Now Siddall Sheffield Scholarship Benefits: Full tuition fees for one year Master’s in Engineering program at the University of Sheffield Stipend of £18,000 Application Deadline: January 13, 2026 at 5:00 PM UK time The Siddall Sheffield Scholarship recognizes academic \r\nexcellence, promise of advancement of the Engineering field, and civic engagement in sponsoring prospective Engineering students to study at the University of Sheffield in the UK. Please note you must first apply to the Engineering Masters program to be considered for this award. Open to: US citizen who has formerly studied in the US, is a non-UK resident, and has not lived in the UK Holds a Bachelor degree in a relevant field before UK departure Preferred GPA of 3.7 or higher Join the \r\nUniversity of Sheffield Postgraduate online open day on Wednesday 26 November 2025 to learn more about the postgraduate programs available. Read More Apply Now Apply Now for 2026 Summer Internships at RAND The RAND Summer Associate Program introduces outstanding graduate students to RAND, an institution that conducts research on a wide range of domestic and international social policy issues and matters of national security. Summer Associates work at RAND full-time for a 12-week period during the summer and are given the opportunity to conduct research while mentored by an experienced researcher. The program is designed for full-time students who have completed at least two years of graduate work leading to a doctorate (e.g., PhD, EDD, DRPH, SciD, \r\netc.) or professional degree (e.g., law or medical degree, professional engineer certificate). Students must be enrolled full-time in a graduate degree program during the spring and fall of 2026 to be considered for the program. Applications are open now and due by December 1, 2025, 11:59 p.m. Pacific Time . Read More New Career Resource: Interstride OGS and the Wasserman Center have teamed up to bring the NYU community a great new resource for international students as well as students looking to work abroad. Interstride is an interactive portal to support your global job search. Access resources for navigating the immigration journey, find jobs from international-student friendly employers, access country guides supporting job searches across the globe, and more! Students can find Interstride at NYUHome . Note: Clicking unsubscribe will unsubscribe you from all emails from the Graduate School of Arts and Science NYU Graduate School of Arts and Science Unsubscribe",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19aa6cdd0959e4fc",
        "from": "GSAS Professional Development <gsas.profdev@nyu.edu>",
        "to": [],
        "subject": "The Grapevine - November 21st, 2025 Issue",
        "date": "Sat, 22 Nov 2025 01:00:18 +1100",
        "timestamp": 1763733618,
        "token_count": 3612
      }
    }
  ]
}