{
  "message_id": "19aeee937ec82506",
  "chunked_at": "2025-12-08T14:33:54.265454",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19aeee937ec82506_email_0_0eb75aac",
      "text": "This email serves as your December 5th, 2025 newsletter for notable professional development and fellowships news at NYU GSAS. This will be our final newsletter of the fall semester! Remember you can stay up to date with all upcoming professional development events by subscribing to our Google calendar , and we wish you all a productive end to the semester and restful winter break. If you have questions about the contents of this newsletter, please contact Abby \r\nWilliams for Professional Development at gsas.profdev@nyu.edu or Emily Hollenbach for Fellowships & Awards at gsas.fellowships@nyu.edu . 2026 Threesis Academic Challenge Application Now Open! The annual Threesis Academic Challenge is a development series and friendly competition designed to showcase the important scholarly work of GSAS master’s students. Over the course of the spring semester, students work with mentors (past Threesis alumni, Bobst Subject Librarians, faculty, and more) to distill their graduate research into a 3 minute oral presentation, developed for a casual non-specialized audience. Students that complete all requirements and make it to the Final Round of the Threesis Academic Challenge have the opportunity to win cash prizes up to $2,000+ . Threesis is a unique opportunity to showcase your scholarly research as a master's student in GSAS. Previous participants, finalists, and winners have gone on to pursue PhD programs \r\nand job interviews with success. Threesis develops robust presentation, public speaking, and research skills that are applicable and valuable to further academic research and professional endeavors alike. GSAS awards the following prizes: 1st Place: $2,000 2nd Place: $1,500 3rd Place: $1000 4th-6th Place: $400 Audience Choice: $750 (in addition to the other prize amount) Read \r\nmore, see testimonials from former student competitors, and apply below! Applications are due February 16 . Contact gsas.threesis@nyu.edu with any questions. Read More Webinar Series: How to Decide Between an Academic and Nonacademic Career December 8 – 11, 2025, 12-12:45 PM ET Virtual PhDs work wherever smart people are needed. In today’s creative economy, a faculty career isn’t the only option for PhDs who are seeking engaging and rewarding work. PhDs work in every part of the economy – industry, nonprofits, higher education, and government. But what career pathway will be right for YOU? This special workshop series hosted by Beyond the Professoriate is designed to walk doctoral students and postdocs through a series of exercises to help them evaluate career options and identify next steps in building their career either as faculty or beyond the professoriate. The series will cover: December 8 – Introduction to your Optimal Career Pathway/How to decide December 9 – How to identify your values December 10 – How to identify your most marketable skills December 11 – How to build your network using on-campus resources Who should attend: This series is uniquely designed for doctoral students, PhDs, and postdocs from all academic disciplines who are wondering: How do I build a community to help me navigate my job search? What other career options are available to PhDs in my discipline? How to identify career pathways that are right for me? What can I do with my PhD? The webinar will be held via Zoom webinar and will be recorded. Advanced registration is required. Register On-Campus Employment for F-1 & J-1 Students Tuesday, December 16th, 9:30AM-10:30AM Virtual Are you an F-1 or J-1 international student who just started (or wants to start) working on campus? There’s some extra steps you should be aware of as an international student. This workshop covers what kind of documentation you will be expected to have, how to apply for your Social Security Number (SSN), and a review of tax resources for non-residents. Learn the basics of this process and get key information on what to expect as you find your on-campus job. Co-sponsored with OGS. Register Roadmapping Your First Year for Career Success Wednesday, December 17th, 9:30AM-10:30AM Virtual Are you a new international student at NYU who is eager to start building your career in the US? As international students, there are visa regulations that limit off-campus employment in the first year but that doesn’t mean you can’t get started building essential skills. Join this Global Career Hub webinar discussing how you can plan and get most out of your first academic year by building a foundation for your career. This webinar is sponsored by the Wasserman Center for Career Development and the Office of Global Services. Register Foundations of Research Computing (FORC) Winter Immersion 2026 Recruiting now! Thursday, January 15, 2026, 10am–4pm Bobst Library, 7th floor (745 and 743) The Foundations of Research Computing “Flash FORC” Winter Immersion 2026 is a one-day data skills immersion program offered to graduate students through a collaboration among NYU Data Services (NYU Libraries and IT), the GSAS Master’s College, and the Arts & Science Office of Teaching Excellence and Innovation. Flash FORC gives participants a grounding in the digital skills essential for their research in a single intensive day. For this winter camp, we’re offering a few new options, including a deep dive into some of the ins and outs of using GenAI in statistical and quantitative analysis; and for FORC Alums, a chance to join experts for a day-long clinic and get help directly with your own project. Each track runs 10am–4pm, with six hours of interactive instruction, broken up with a one-hour free lunch. Students can take advantage of 1:1 consultations, connect with specialists, and network with fellow graduate students. Participants who complete the program will receive a letter of completion for their portfolio detailing the skills covered in their track. Send inquiries to asteaching@nyu.edu , and read about each track and register below. Read More Transform Your Career with NYU’s International Student Career Academy (ISCA)! Registration Deadline: February 5, 2026 Program Dates: February 10, 12, 17, 19, 2026 Format: 2 in-person sessions (Wasserman Center) + 2 virtual sessions (Zoom) ISCA is a high-impact, four-session experience designed for international students who want to excel in the U.S. job market. You’ll tap into career design tools, practical job-search strategies, and real-world guidance from professionals who’ve walked your path, all within an inclusive, supportive learning environment. Explore program details here ! Students who complete most sessions will earn a Certificate of Achievement. Register as soon as you see this; space is limited. Step into your next chapter with \r\nconfidence. Register below today! Register Enroll in Spring 2026 Public Humanities Courses! The Spring 2026 Public Humanities curriculum is now available on our website ! There, you will find full descriptions of core curriculum as well as departmental electives approved for completion of the Advanced Certificate in the Public Humanities . The Case Studies in Public Humanities (PUBHM-1101) course is hands-on and experiential, rather than seminar-based, meaning that you'll get the chance to actively work on real public humanities projects . It is open to all GSAS graduate students and provides an exciting opportunity to get practical experience with public-facing work. This semester, we are excited to offer a new partnership with the Kevorkian Center and a continuation of our existing partnership with The Hemispheric Institute : Case Studies in Public Humanities (PUBHM-1101): Public Pedagogies and Policies with the Kevorkian Center In this course, you will work with the Kevorkian Center team to foster public understanding of various world regions, including the Middle East, around issues and challenges of everyday life for people across the globe and in NYC, mainly through public K-12 education and outreach. Coursework likely involves three project topics – Kevo’s Spring \r\nInstitute, transforming NYC civic education, and public humanities grant-writing. Case Studies in Public Humanities (PUBHM-1101) : The Hemispheric Institute and HIDVL In this practice-based course you will take up the practice, theory, and politics of archive making through collaborative work on the Hemispheric Institute Digital Video Library (HIDVL), a groundbreaking archive of theater, performance, art, activism, and scholarship from across the Americas \r\nfrom the 1960s to the present. The seminar will meet weekly for the first 7 sessions to introduce the work, history, and archival tasks at Hemi. After those 7 sessions, your seminar attendance becomes more individualized and flexible, and your projects will guide your schedule. You will work with the Hemi team to help create new HIDVL collections, understand the meaning and making of archives and metadata, contextualize collection videos with metadata and research resources, create profiles for new collections, learn how to conduct an artist interview, create a Research Guide on a subject of your choosing in HIDVL, and conduct a User Experience survey. Spanish, Portuguese, or Kreyòl language skills are helpful but not required. Enrollment for this course is capped at 10. Read about all available courses at the link below, and register on Albert! Read More Resources Beyond the Professoriate Beyond the Professoriate is a professional development tool where doctoral students and postdocs can explore your career options , make informed career decisions , \r\nand learn proven job search strategies . Big Interview Big Interview 's proven, step-by-step system combines expert video lessons and interactive interview practice tools to help students land their dream job. Through this career tool, students will get hands-on practice with mock interviews tailored to their specific industry, job, and experience level. Wasserman Headshot Photo Booth Visit the Headshot Photo Booth at the Wasserman Union Square location anytime the office is open to use the self-service booth. You can even borrow professional clothing from the career closet for your photo! Read more here. LinkedIn Learning NYU provides no-cost access to LinkedIn Learning with thousands of online how-to tutorials taught by real-world professionals covering topics that include technology, business, and creative skills. You'll find tutorials on personal branding, video editing,  Google Sheets, and much more. Focus 2 Career Explore different career options through interactive, online assessments. Reflect on your values, skills, and interests and relate them to possible career paths! Reminder: Use Fellowship Databases! GSAS Fellowships encourages you to view their website . But fellowship databases and guides on our External Resources page can also be helpful! Social Sector Leadership Diversity Fellowship (SSLD) Benefits: Monthly workshops Personalized coaching Retreats Speaker/Panel events Peer and alumni network Application \r\nDeadline: December 7th, 2025 at 11:59 PM ET NYU's Social Sector Leadership Diversity Fellowship (SSLD) is an 18-month leadership development experience for NYU graduate students across all disciplines who are committed to making an impact in the social sector. SSLD provides the skills, support, and community to help you grow your capacity to influence systems, bridge divides, and tackle today’s most pressing social challenges. Fellows join a vibrant, cross-school cohort of NYU changemakers creating lasting change locally, nationally, and globally. Now in its thirteenth year, SSLD alumni have built career paths making social change in every industry they touch; ranging from cybersecurity and public health to food sovereignty and \r\ndisability-inclusive education. Whether you’re refining your leadership style or exploring new ways to drive and grow your impact, SSLD offers a space where you can bring your whole, authentic self —and clarify your purpose and vision for change alongside a supportive peer and alumni network. Open to: Graduate students enrolled for the duration of the 2026-2027 academic year Good academic and disciplinary standing Commitment to public service Read More Apply Now 2026-27 Language Fellowships from the Blakemore Foundation Benefits: Full tuition and stipend for living, travel, and study expenses Application Deadline: December 30th, 2025 at 11:00 PM PST Blakemore Foundation Asian Language Fellowships are awarded for one academic year for the advanced study of Chinese (in Taiwan), Japanese, Korean, \r\nIndonesian, Khmer, Thai, or Vietnamese in Asia. Study of Chinese at Tsinghua University in Beijing is also available as a Blakemore Fellowship. Open to: U.S. citizens or permanent residents Graduate students and young/mid-career professionals planning to use referenced language(s) in their career Have completed at minimum the third year of study of the Asian language, and ready to advance to professional fluency Blakemore Kingfisher Art History Language Fellowships are awarded \r\nfor 9-12 months for study of Chinese or Korean in East Asia, who have a well-demonstrated intent to study the pre-twentieth century history of Chinese or Korean art at the doctoral level. Open to: U.S. and Canadian citizens or permanent residents and foreign nationals studying in U.S. or Canadian colleges Interest in pursuing doctoral degree in pre-twentieth century Chinese or Korean art history Have completed at minimum the second year of study of the Asian language in rigorous college-level language programs Read More Apply Now Siddall Sheffield Scholarship Benefits: Full tuition fees for one year Master’s in Engineering program at the University of Sheffield Stipend of £18,000 Application Deadline: January 13, 2026 at 5:00 PM UK time The Siddall Sheffield Scholarship recognizes academic \r\nexcellence, promise of advancement of the Engineering field, and civic engagement in sponsoring prospective Engineering students to study at the University of Sheffield in the UK. Please note you must first apply to the Engineering Masters program to be considered for this award. Open to: US citizen who has formerly studied in the US, is a non-UK resident, and has not lived in the UK Holds a Bachelor degree in a relevant field before UK departure Preferred GPA of 3.7 or higher Read More Apply Now US Teaching Assistantship (USTA) Program in Austria Benefits: Monthly net salary of approx. €1,631/ around $1,887 Comprehensive health insurance Opportunities to increase German-language proficiency Access to Fulbright Austria events Application Deadline: January 15, 2026 The USTA Program facilitates temporary job placements of US citizens at Austrian secondary schools as English language teaching assistants for 13 hours per week for the length of an academic year. Teaching experience is not required but beneficial. Applicants need to be independent, resilient, adaptable to different environments, open, communicative, and reliable – they will be fully immersed in Austrian daily life, bureaucracy, and working culture. Placements are from October 2026 to May 2027. Open to: U.S. citizens Bachelor’s degree holders German proficiency: B1/Intermediate Mid or above Sign up for one of the various info sessions here ! Read More Apply Now 2026-2027 VPAF103-Legacy Awards Benefits: $2,000 award for applicants who have completed their undergraduate degrees in the last three years $5,000 award for applicants with 3+ years of professional experience in fields related to national security and terrorism prevention Application Deadline: February 21st, 2026 The VPAF 103 Legacy Award of Victims of Pan Am Flight 103, Inc. was established to support students pursuing advanced degrees in areas of study related to improved national security and terrorism prevention as they prepare for careers focused on keeping citizens safe from the threats of terrorism and preventing the deaths of innocent men, women, and children. Two scholarships are awarded each year. Open to: Students pursuing graduate degrees at U.S. institutions during the 2026-2027 grant year Undergraduate degree completed in the U.S. Field of study must be related to improved national security and terrorism prevention Demonstrated leadership and high academic/professional achievement Read More Apply Now The Rockefeller Institute of Government New York State Science Policy Fellowship (Postdoctoral Associate) The 2026-28 Science Policy Fellows (SPF) will participate in an educational and professional development program crafted by the Rockefeller Institute during their first year, preparing them to engage directly with policymakers. This includes a week-long orientation and regular coursework featuring guest speakers from various state policy backgrounds and readings on the intersection of science and policy. In addition, during their second year, fellows will regularly meet with experienced mentors whose careers and expertise will help guide their \r\npotential future work in the public sector, as well as develop a capstone project proposing public policies (executive orders, legislation, regulatory proposals, or state programs) related to key science and technology policy issues.Entering its third year, this initiative will select six science, technology, or engineering doctorate holders as fellows to work closely with senior policymakers in the offices of the governor, the legislature, and state agencies for a two-year period. The fellowship is located in Albany, New York, and will pay selected fellows $85,000 annually Applications are open now and due by January 9, 2026 at 11:59PM EST. Read More New Career Resource: Interstride OGS and the Wasserman Center have teamed up to bring the NYU community a great new resource for international students as well as students looking to work abroad. Interstride is an interactive portal to support your global job search. Access resources for navigating the immigration journey, find jobs from international-student friendly employers, access country guides supporting job searches across the globe, and more! Students can find Interstride at NYUHome . Note: Clicking unsubscribe will unsubscribe you from all emails from the Graduate School of Arts and Science NYU Graduate School of Arts and Science Unsubscribe",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19aeee937ec82506",
        "from": "GSAS Professional Development <gsas.profdev@nyu.edu>",
        "to": [],
        "subject": "The Grapevine - December 5th, 2025 Issue",
        "date": "Sat, 06 Dec 2025 01:00:15 +1100",
        "timestamp": 1764943215,
        "token_count": 4565
      }
    }
  ]
}