{
  "message_id": "19aee6a7e6f6dffc",
  "chunked_at": "2025-12-08T14:33:42.127819",
  "total_chunks": 1,
  "chunks": [
    {
      "chunk_id": "19aee6a7e6f6dffc_email_0_81d996f1",
      "text": "Spec Top Computer SCI:, Section 091 - Announcements: Remote class and guest lecture today Dec 5 Spec Top Computer SCI:, Section 091 - Announcements: Remote class and guest lecture today Dec 5 Posted Friday, December 5, 2025 7:07 AM EST ello, The class will be held remotely over Zoom today. Today's class will be focused on GenAI platform in enterprise, APIs and MCP. We have a guest lecture today. From APIs to Agents: Building AI-Ready Platforms in the Enterprise Abstract Generative AI is transforming modern software systems, but deploying it inside enterprises requires more than calling a model API. This session explores the architectural foundations of GenAI platforms: how APIs, gateways, model routing, and protocols like MCP enable scalable, governable, and multi-model AI integration. We’ll walk through engineering patterns for API management at scale, cloud-native orchestration, multi-provider routing, latency–cost–safety tradeoffs, blast radius reduction, observability pipelines, and security controls across the AI stack. Students will see how agents invoke tools, how AI gateways abstract provider differences, and how platform teams design resilient, policy-driven AI systems suitable for real-world environments. Speaker Bio Krithika Prakash is a Senior Distinguished Engineer at Capital One, leading enterprise Data and AI Platform strategy in the financial services sector. She brings 15 years of industry experience in AI architecture, API ecosystems, and cloud systems, previously serving as an AI Integration Architect at IBM where she focused on security and integration patterns across the API Management and Gateways portfolio. Krithika has contributed to Columbia University’s Reinforcement Learning course on Coursera, holds a Master’s in Machine Learning from Columbia University, and patents in the areas of security and integration. Spec Top Computer SCI:, Section 091 Go to Announcements >> You are receiving this message because you subscribed to receive instant notifications via email. Change Notification Settings",
      "metadata": {
        "chunk_index": 0,
        "source_type": "email_body",
        "message_id": "19aee6a7e6f6dffc",
        "from": "\"noreply@mail.brightspace.nyu.edu\" <noreply@mail.brightspace.nyu.edu>",
        "to": [],
        "subject": "Spec Top Computer SCI:, Section 091 - Announcements: Remote class and guest lecture today Dec 5",
        "date": "Fri, 05 Dec 2025 12:09:05 +0000",
        "timestamp": 1764936545,
        "token_count": 513
      }
    }
  ]
}