{
  "id": "19afde69be88b77f",
  "from": "Romeo Kumar <kumar@cs.nyu.edu>",
  "subject": "[cs-opportunities] Marcus Autism Center Pre-Doctoral Fellowship Opportunities for Seniors and Recent Graduates",
  "date": "Mon, 8 Dec 2025 07:14:40 -0500",
  "eml_path": "data/raw_emails/19afde69be88b77f.eml",
  "attachments": [
    {
      "filename": "Marcus_Autism_Fellowships.pdf",
      "path": "data/attachments/19afde69be88b77f_Marcus_Autism_Fellowships.pdf"
    }
  ],
  "body_text": "Hello,\r\n\r\nThe Marcus Autism Center, in conjunction with the Emory University School\r\nof Medicine and Children's Healthcare of Atlanta, is offering three\r\nfellowships: the ACCESS Fellowship in Implementation Science, the Cohen\r\nFellowship in Developmental Social Neuroscience and the Simons Fellowship\r\nin Computational Neuroscience,\r\n\r\nStudents who will receive a bachelor's degree by June 2026 will be eligible\r\nfor the positions. The fellowships will commence in July 2026, and they are\r\n2 years in duration. Students can find further details here\r\n<https://urldefense.proofpoint.com/v2/url?u=https-3A__med.emory.edu_departments_pediatrics_divisions_autism_fellow_index.html&d=DwMGaQ&c=slrrB7dE8n7gBJbeO0g-IQ&r=80cd5DVpUcN3Ok07Ocnexg&m=sdrKs6FCVA43LN0ew9e2ewFJz8FBttm2nUhWkhFe0gq4SBNO9mi706Y6EWdDUTdw&s=XVx6MMl7EzJo3H9PLh2Ezu_UyYNF51MdF_ncSk0NCzo&e=>.\r\n\r\n\r\nAttached, please find a brochure describing the fellowships. Please feel\r\nfree to print the brochure and post it in your department. I ask that you\r\nlet us know that you have received this e-mail and that you forward it,\r\nalong with the associated brochure, to students in the Department of\r\nComputer Science who may be interested in this opportunity.\r\n\r\nThe ACCESS Fellowship in Implementation Science will select fellows for a\r\ntwo-year training in research focused on community engagement participatory\r\nmethods, translating evidence-based services for autism into community\r\nsettings, as well as the processes and partnerships that support these\r\nefforts.\r\n\r\nThe Cohen Fellowship in Developmental Social Neuroscience will involve\r\ncutting-edge social neuroscience and/or neuroimaging research in infants,\r\ntoddlers and adolescents. Fellows will work to further the understanding of\r\nautism through eye-tracking research, guiding a project from the point of\r\ndata collection to publication of results.\r\n\r\nThe Simons Fellowship in Computational Neuroscience will involve\r\nintegrating computational strategies with clinical research goals. Fellows\r\nwill develop methods for the analysis of visual scanning and eye-tracking\r\ndata, computational models of visual salience, and data visualization\r\ntechniques, all with the aim of advancing the understanding of autism and\r\nefforts at early diagnosis.\r\n\r\nThank you for your help! We look forward to hearing from you.\r\n\r\nSincerely,\r\nMarcus Predoctoral Fellowship Committee\r\n------------------------------\r\n\r\nMarcus Autism Center, Children's Healthcare of Atlanta, &\r\nEmory University School of Medicine\r\nPhone: 404-785-9554\r\nEmail: marcus.predoc-fellowships@emory.edu\r\n<+marcus.predoc-fellowships@emory.edu>",
  "body_html": "<div dir=\"ltr\"><div class=\"gmail_quote gmail_quote_container\"><div><p>Hello, </p>\r\n\r\n<p>The Marcus Autism Center, in conjunction with the Emory University School of Medicine and Children&#39;s Healthcare of Atlanta, is offering three fellowships: the ACCESS Fellowship in Implementation Science, the Cohen Fellowship in Developmental Social Neuroscience\r\n and the Simons Fellowship in Computational Neuroscience, </p>\r\n<p>Students who will receive a bachelor&#39;s degree by June 2026 will be eligible for the positions. The fellowships will commence in July 2026, and they are 2 years in duration. Students can find further details\r\n<a href=\"https://urldefense.proofpoint.com/v2/url?u=https-3A__med.emory.edu_departments_pediatrics_divisions_autism_fellow_index.html&amp;d=DwMGaQ&amp;c=slrrB7dE8n7gBJbeO0g-IQ&amp;r=80cd5DVpUcN3Ok07Ocnexg&amp;m=sdrKs6FCVA43LN0ew9e2ewFJz8FBttm2nUhWkhFe0gq4SBNO9mi706Y6EWdDUTdw&amp;s=XVx6MMl7EzJo3H9PLh2Ezu_UyYNF51MdF_ncSk0NCzo&amp;e=\" target=\"_blank\">\r\nhere</a>. </p>\r\n<p>Attached, please find a brochure describing the fellowships. Please feel free to print the brochure and post it in your department. I ask that you let us know that you have received this e-mail and that you forward it, along with the associated brochure,\r\n to students in the Department of Computer Science who may be interested in this opportunity.\r\n</p>\r\n\r\n<p><span style=\"font-weight:bold\">The ACCESS Fellowship in Implementation Science</span> will select fellows for a two-year training in research focused on community engagement participatory methods, translating evidence-based services for autism into community\r\n settings, as well as the processes and partnerships that support these efforts. </p>\r\n<p><span style=\"font-weight:bold\">The Cohen Fellowship in Developmental Social Neuroscience</span> will involve cutting-edge social neuroscience and/or neuroimaging research in infants, toddlers and adolescents. Fellows will work to further the understanding\r\n of autism through eye-tracking research, guiding a project from the point of data collection to publication of results.\r\n</p>\r\n<p><span style=\"font-weight:bold\">The Simons Fellowship in Computational Neuroscience</span> will involve integrating computational strategies with clinical research goals. Fellows will develop methods for the analysis of visual scanning and eye-tracking data,\r\n computational models of visual salience, and data visualization techniques, all with the aim of advancing the understanding of autism and efforts at early diagnosis.\r\n</p>\r\n\r\n<p>Thank you for your help! We look forward to hearing from you. </p>\r\n\r\n<p>Sincerely, <br>\r\nMarcus Predoctoral Fellowship Committee </p>\r\n\r\n<hr>\r\n<p>Marcus Autism Center, Children&#39;s Healthcare of Atlanta, &amp; <br>\r\nEmory University School of Medicine <br>\r\nPhone: 404-785-9554 <br>\r\nEmail: <a href=\"mailto:+marcus.predoc-fellowships@emory.edu\" target=\"_blank\">marcus.predoc-fellowships@emory.edu\r\n</a></p>\r\n\r\n</div>\r\n\r\n</div></div>"
}