{
  "filename": "19a2beedbec581a4_2026 BME-CAIR Research Project Descriptions.pdf",
  "path": "data/attachments/19aadaf0f535cdc9_19a2beedbec581a4_2026 BME-CAIR Research Project Descriptions.pdf",
  "text": "NSF\nCHIN\nWake Forest University School of Medicine 28 50 10 28 32 32 100 100 1E0 Canvolutional Lever 2l Max-pooling Ma-poolina layer 21 Feature layer SOGEGAGTCA AATAT CAT GC G\nInput laver\nCeewolution all layer 1\n2026 Research Project Descriptions\nSummer Research Internship Program\nfor Undergraduate & MS Graduate Students\nNSF\nIII\nNAID\nCENTER FOR ARTIFICIAL INTELLIGENCE RESEARCH\nA III\nNIH\n40+ Projects in Biomedical Engineering, Biomedical Informatics, AI, & more!\nlaver 1\nveron. Sluures mcorpoldle a lange ul musculoskeletal metous, moluumo puted tomography (QCT) of the hip and spine, and high-resolution peripheral\nWake Forest University outed tomography (HRpQCT) of the ankle and wrist. K\n1) review the literature on weight loss oss and techniques for measuring bone\nSchool of Medicine G\nand HRpQCT, 2) form a hypothesis to\nProject 1 - Summer 2026\nnd 3) experimentally test the hypothesis\nIntervening to Mitigate Weight Loss Associated Bone Loss\nIdentification of intervention strategies to minimize weight loss associated bone loss among middleaged and older adults is needed. Two 12-month NIH clinical trials were recently funded to: 1) test whether  bisphosphonate  therapy  can  minimize  bone  and  muscle  loss  associated  with  bariatric surgery  among 120 sleeve gastrectomy patients, and 2) compare the independent and combined effects  of  progressive  resistance  training  plus  bone  loading  exercises  and  bisphosphonate  use  on measures of bone density, quality, and turnover in 308 older adults who are undergoing a dietary weight  loss  intervention.  Studies  incorporate  a  range  of  musculoskeletal  methods,  including quantitative  computed  tomography  (QCT)  of  the  hip  and  spine,  and  high-resolution  peripheral quantitative computed tomography (HRpQCT) of the ankle and wrist.\nProfessor\nThe student will: 1) review the literature on weight loss associated bone loss and techniques for measuring bone health  using  QCT  and  HRpQCT,  2)  form  a  hypothesis  to test  the  effect  of  skeletal  loading  and  bisphosphonate interventions on CT-derived bone outcome such as bone mineral density (BMD), cortical thickness, bone strength, or fracture risk, and 3) experimentally test the hypothesis by  applying  learned  CT  analysis  and  finite  element  (FE) modeling techniques to collect, analyze, and draw conclusions from the resulting bone outcome data.\nAshley Weaver, PhD\nKristen Beavers, PhD\nProfessor Gerontology & Geriatric Medicine Wake Forest School of Medicine Winston-Salem, NC\nhttps://school.wakehealth.edu/faculty/b/ kristen-marie-beavers\nProfessor Biomedical Engineering Wake Forest School of Medicine Winston-Salem, NC\nAshley Anne Weaver, PhD | Wake Forest University School of Medicine\nV\n2x\nWake Forest University\nSchool of Medicine\nProject 2 - Summer 2026\nIn-Situ Bioprinting Path Planning in Augmented Reality\nIn-Situ Minimally Invasive Surgical Robotic Bioprinting\nBioprinting has been well established as a method of developing biomimetic structures for tissue engineering to create scaffolds, constructs, and organoids. The  process  of bioprinting using  Cartesian  and  multi-axis  additive manufacturing  allows  for  a  synergistic pairing with surgical robotics. This project aims to develop an in-situ laparoscopic  bioprinting  system  through the  research  of  supporting  technologies in real-time scanning and sensing, motion compensation mechatronics, and augmented reality surgical planning and control.\nWe are creating a printing platform that can scan organic surfaces and adapt the extruder  height  and  flow  rate  within acceptable tolerances is needed to overcome in-situ printing challenges. We are  looking  for  help  in  control  systems, tool  design,  biomaterials,  software  and augmented reality.\nPhilip Brown, PhD\nAssociate Professor, Biomedical Engineering Director, Translational Engineering and Design Core\nOffice: 336-716-0945\nphibrown@wakehealth.edu www.linkedin.com/in/philip-brown-71a24553\nmanulaculmo, anlu prouuctor amoud a vallety ur matellar ane prmus lectoroges.\nWake Forest University\nSchool of Medicine\nModulus\nCloud\nModel\nManufacture\nProject 3 - Summer 2026\nMechanically Matched Patient Specific Bone Surrogates\nRecent advancements in super resolution artificial intelligence, additive manufacturing, and highperformance  computing  present  unique  opportunities  in  the  space  of  medical  device  design  for patient  specific  implants  and  patient/population  specific  mechanical  surrogate  bones.  We  are working  to  create biomechanically  accurate subject  specific 3D-printed  bone  surrogates  from clinical resolution CT scans. We are working to create and validate workflows for image analysis, mechanical analysis and interpretations, design from mechanical properties for additive manufacturing, and production through a variety of material and printing technologies.\nAssociate Professor, Biomedical Engineering\nDirector, Translational Engineering and Design Core\nOffice: 336-716-0945\nphibrown@wakehealth.edu\nwww.linkedin.com/in/philip-brown-71a24553\nPhilip Brown, PhD\nAssociate Professor, Biomedical Engineering Director, Translational Engineering and Design Core\nOffice: 336-716-0945\nphibrown@wakehealth.edu www.linkedin.com/in/philip-brown-71a24553\nFlexion - Etension (mm)\n20\n15\n10|\n-15|\nWake Forest University\nSchool of Medicine\nProject 4 - Summer 2026\nFull Field Spinal Characterization Methodology Development\nLateral Bending (mm)\nThe widely accepted method for evaluating spinal biomechanics developed  by  Panjabi  et  al  has  been  adopted  into  standards such as ASTM F2077-22 to validate spinal implants. This method involves applying a pure Cartesian moment to a spinal segment or a functional spinal unit (FSU) in each physiologic plane, then measuring  the  resulting  range  of  motion  (ROM),  loading  and unloading stiffness, hysteresis, and neutral zone (NZ) behavior. While  planar  moment  testing  is  a  standardized  and  powerful tool,  it  leaves  the  spinal  motion-loading  space  in-  between planes  untested  and  unknown.  Adding  more  simultaneous dimensions of  loading  in  a  full-field  multi-planar  methodology will  lead  to  deeper  insight  into  the  complex  physiological behavior of the spine in various surgical interventions.\nTo  address  this  gap,  we  propose  a  novel  testing  protocol  that uses  six-degree-of-freedom  trajectories  to  produce  complex motion paths which mapping the spine's full-field  multi-planar behavior. This exploration enables multidimensional visualization  of  the spine's bending  stiffness  in  all  directions within its physiological limits. The objective of this study was to debut complex multi-planar spinal testing, explore visualization strategies,  and  identify  spinal  behavior  insights  gained  relative to traditional testing.\nPhilip Brown, PhD\nAssociate Professor, Biomedical Engineering Director, Translational Engineering and Design Core\nOffice: 336-716-0945\nphibrown@wakehealth.edu www.linkedin.com/in/philip-brown-71a24553\nCS\n2S\n1\nle\nCAPLA\nWake Forest University School of Medicine\nProject 5 - Summer 2026\nAssessment of Pedestrian Crash Protection Systems using RealWorld Pedestrian Crash Data in CARLA\nModern vehicles are equipped with advanced safety features including pedestrian crash avoidance but there are still numerous scenarios  where  these  systems  fail  to  avoid crashes.\nCARLA  is  an  open-source  tool  developed  to support the development, training, and validation of autonomous driving systems.\nThe  project  objective  is  to  use  this  tool  to assess  existing  and  new  safety  systems  by reconstructing real-world pedestrian crashes.\nThe student will help create pedestrian crash scenarios and test different sensor suites in a virtual environment.\nStudent will build skills in pythonprogramming, crash data analysis, biomechanics, and injury analysis.\nKaran Devane, PhD\nAssistant Professor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave\nWinston-Salem, NC 27101\nhttps://school.wakehealth.edu/faculty/d/karan-shamrao-devane\nIMPACT ZONE\nWake Forest University School of Medicine SKID MARKS\nDEBRIS FIELD.\nProject 6 - Summer 2026\n(80%)\nDevelopment of Machine Learning Model for Predicting Pedestrian Injuries using Real-World Crash Databases\nImages, vehicle parameters, crash details, and pedestrian injury data from the crash databases will be used to train and test a machine learning model that will be used to predict pedestrian injuries.\nStudent will be parsing the databases to collect all the required data, preprocess it, and build an injury prediction model.\nStudent  will  build  skills  in  python-programming,  crash  data  analysis,  biomechanics,  and  injury analysis.\nStudent will get to interact with multidisciplinary team of experts.\nSchool of Biomedical Engineering and Sciences https://school.wakehealth.edu/faculty/d/karan-shamrao-devane\n575 N. Patterson Ave\nWinston-Salem, NC 27101\nKaran Devane, PhD\nAssistant Professor, Biomedical Engineering\nVT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nhttps://school.wakehealth.edu/faculty/d/karan-shamrao-devane\n/e\n1\nWake Forest University\nSchool of Medicine\nProject 7 - Summer 2026\nHuman Body Model Development for Trauma Research\nComputational modeling is a growing  component of injury biomechanics and trauma  research. This project  is  a  multi-center  effort    developing  a  next  generation  set  of  human  body    finite  element models for enhanced injury  prediction and prevention systems. The student  will be responsible for assisting in model  development tasks including scaling, postural  adjustment, meshing, and contact algorithm  development. Responsibilities will also include  reporting FEA model analysis and results, running analyses on distributed computing environments, simulating validation procedures, performing literature reviews, and reporting  related research efforts through written and oral  status updates.  The  student(s)  will  gain    valuable  experience  in  fields  of  trauma    research,  computer modeling, and injury  biomechanics.\nThis  research effort will  be  in  the  Center  for  Injury Biomechanics (CIB) and you will have the opportunity to work on a range of projects centered around safety. The human is at the center of all the research we do. We operate in the fields of mobility safety, data analytics including database and medical  image  analysis,  military  countermeasures, and  sports  biomechanics.  The  research  at  the  CIB combines experimental testing, computational modeling, and analytics to investigate human injury biomechanics\nScott Gayzik, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nwww.CIB.vt.edu\n/e\n1\n1.0\nWake Forest University\nSchool of Medicine\nProject 8 - Summer 2026\nStandardizing Methods for Virtual Assessment in Human Body Models\nHuman body models (HBMs) have gained prominence in biomechanics literature over  the last two decades, but there is little information available regarding the standardization of model positioning and injury assessment. It is  well understood that deviations in initial positioning of human models can lead to deviations in outcomes for otherwise identical crash simulations, yet this effect is not well quantified. This project focuses on developing best practices (BPs) for simulation-based repositioning,  gravity-    settling,  belting,  pre-test  posture  reporting  and  injury  prediction  using computational  human  body  models.  Your  research  will  be  on  the  cutting  edge  of  this  digital transformation of the regulatory space!\nThis  research effort will  be  in  the  Center  for  Injury Biomechanics (CIB) and you will have the opportunity to work on a range of projects centered around safety. The human is at the center of all the research we do. We operate in the fields of mobility safety, data analytics including database and medical  image  analysis,  military  countermeasures, and  sports  biomechanics.  The  research  at  the  CIB combines experimental testing, computational modeling, and analytics to investigate human injury biomechanics.\nScott Gayzik, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nwww.CIB.vt.edu\n/e\n1\nWake Forest University\nSchool of Medicine\nProject 9 - Summer 2026\nPhysics-based Finite Element Analysis for Injury Criteria Using Human Surrogates\nThe  objective  of  this  research  is  to  develop  and  validate  a  physics-based  finite  element  model(s) (ovine and caprine) to study behind armor blunt trauma (BABT).  These models will be an important tool for evaluating countermeasures and developing  computational injury criteria to better protect service members. The models will be used to provide insight and guidance on the risk of skeletal and soft  tissue  injuries  including  the    development  of  injury  criteria  for  rib,  pulmonary  and  limited vascular  and  peripheral  organ    injury  from  BABT.  The  proposed  project  is  the  first  of  its  kind  to develop ovine and caprine  FEA models for use in the study of BABT. Specifically, the models will be used to develop  finite element based BABT injury criteria.\nThis  research effort will  be  in  the  Center  for  Injury Biomechanics (CIB) and you will have the opportunity to work on a range of projects centered around safety. The human is at the center of all the research we do. We operate in the fields of mobility safety, data analytics including database and medical  image  analysis,  military  countermeasures, and  sports  biomechanics.  The  research  at  the  CIB combines experimental testing, computational modeling, and analytics to investigate human injury biomechanics.\nScott Gayzik, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nwww.CIB.vt.edu\n/e\n1\nWake Forest University School of Medicine 14272 HIC 14272. B/C\nProject 10 - Summer 2026\nDevelopment of Signal Analysis Tools for a National Crash Database\nThe key objective of this effort is to modernize the United States federal government's Vehicle Safety Research Signal Analysis Tools. Our fundamental motivation for this work is to 1. Modernize the code offered by creating a fully web-based tool and 2. Update the existing code to interact with a Crash Test  Database  that  already  exists  online.  The  approach  we  will  take  involves  a  ground  up reconstruction of the underlying code. The student will assist by helping build the code and running calculations of fundamental biomechanical measures used in kinematic, kinetic and injury assessments. The project is sponsored by the National Highway Traffic Safety Administration.  This is an opportunity to see your work be used by hundreds or even thousands of users worldwide.\nThe  project  will  marry  the  fields  of  web-based  software  development  and  biomechanics  and represents an exciting opportunity for engineers interested in both domains. The skills and training a student  will  develop  on  for  this  project  will  be  highly  translatable  for  careers  in  biomechanics  or software development.\nThis  research effort will  be  in  the  Center  for  Injury Biomechanics (CIB) and you will have the opportunity to work on a range of projects centered around safety. The human is at the center of all the research we do. We operate in the fields of mobility safety, data analytics including database and medical  image  analysis,  military  countermeasures, and  sports  biomechanics.  The  research  at  the  CIB combines experimental testing, computational modeling, and analytics to investigate human injury biomechanics.\nScott Gayzik, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nwww.CIB.vt.edu\nimplementation, and/or delivery of quantitative results.\nWake Forest University School of Medicine In response, our laboratory has applied a molecular detection strategy using the solid-state nanopore platform, which is able to detect and size HA electrically\nand with tremendous sensitivity. Here, we will apply our\nassay to probe the HA content of plasma derived from\nProject 11 - Summer 2026\nMolecular Detection and Analysis of Trauma Bioindicators\nHyaluronan (or hyaluronic acid, HA) is a  key  linear  sugar that  is found  in  all  physiological  fluids  and tissues,  where  variation  in  its  composition  can  either  result  from  or  be  a  direct  cause  of  disease emergence. While changes in net HA abundance in biofluids can be probed conventionally, this metric ignores a critical size-function relationship in which high- and low-molecular weight (MW) HA exhibit contrasting effects on inflammation, angiogenesis, cell motility, and more. Consequently, determination  of  both  HA  abundance and size  distribution  is  essential.  However,  many  important physiological  systems  contain  small  total  amounts  of  HA  and  technologies  for  comprehensive assessment have critical limitations in sensitivity as well as challenges in dynamic range, cost, ease of implementation, and/or delivery of quantitative results.\nIn response, our laboratory has applied a  molecular detection strategy using the solid-state nanopore platform,  which  is  able  to  detect  and  size  HA  electrically and with tremendous sensitivity. Here, we will  apply our assay  to  probe  the  HA  content  of  plasma  derived  from trauma patients. As a central goal of this project, we aim to  investigate  HA  MW  as  a  bioindicator  of  outcomes  for patients presenting with similar trauma severities.\nThe student who joins our team will learn and/or perform one or more of the following activities:\nBiochemical extraction of hyaluronan from physiological samples\nMolecular detection with the solid-state nanopore platform\nData analysis & reporting\nAdam Hall, PhD\nAssociate Professor, Biomedical Engineering VT-WFU School of Biomedical Engineering and Sciences Wake Forest University School of Medicine 575 N Patterson Ave.\nWinston-Salem, NC 27101\nhttps://thehalllab.org\nle\nAccelerometer\nGyroscope\nEMG\nActivity\nAnalysis\nWake Forest University 10I Modules Gait\nSchool of Medicine\nPostural\nProject 12 - Summer 2026\nBalance and Mobility Phenotypes of Fall Risk in Persons with Multiple Sclerosis\nThis  project  will  leverage  digital  health  technologies  (i.e.,  wearables,  mobile  apps)  and  AIbased informatics to identify potential biomechanical, physiological, and behavioral markers of fall risk in persons with multiple sclerosis (PwMS).\nFalls are a significant healthcare problem without a clear solution. Fifty percent of PwMS will fall in any three-month period with nearly half of those falls resulting in injury. Techniques that can  detect  when  a  PwMS  is  at  risk  for  falling  could  enable  the  development  of  new preventative interventions. We have collected multimodal wearable sensor data during daily life from more than 50 PwMS, capturing thousands of balance challenging activities that could be used to detect fall risk. We aim to explore how these data can be used to inform AI-based phenotypes of fall risk.\nThe student will: 1) review literature  2)  manage  thousands of daily life observations of balance challenging activities, and 3) leverage machine learning and statistical analysis techniques  to  identify  indicators of fall risk\nRyan McGinnis, PhD\nAssociate Professor Department of Biomedical Engineering Center for Remote Health Monitoring Wake Forest University School of Medicine\nWake Forest University\nSchool of Medicine\nProject 13 - Summer 2026\nDigital Health Measures of Postpartum PTSD\nThis  project  will  leverage  digital  health  technologies  (i.e.,  wearables,  mobile  apps)  and  AIbased informatics to identify potential biomechanical, physiological, and behavioral markers of post-traumatic stress disorder (PTSD).\n•BioStampRi\nOne in 15 pregnancies result in postpartum PTSD, which has direct bearing on child bonding and familial relationships.  Early  postpartum  is  a  sensitive  period  for risk to transmit from one generation to the next, and early intervention  could  improve  child  outcomes.  We  need destigmatized  approaches  to  alert  new  mothers  about PTSD symptoms and get them directed to care early, when intervention  can  make  the  largest  impact  on  them  and their maternal-infant bonding.\nThe student will: 1) review literature 2) help to collect and manage  data  from  a  pilot  cohort  of  postpartum  women, and  3)  leverage  machine  learning  to  identify  potential predictors of PTSD.\nRyan McGinnis, PhD\nAssociate Professor Department of Biomedical Engineering Center for Remote Health Monitoring Wake Forest University School of Medicine\nEllen McGinnis, PhD Assistant Professor Division of Public Health Sciences Center for Remote Health Monitoring Wake Forest University School of Medicine\nWake Forest University\nSchool of Medicine\nProject 14 - Summer 2026\nPredicting Panic Attacks in the Wild\nThis  project  will  leverage  digital  health  technologies  (i.e.,  wearables,  mobile  apps)  and  AIbased informatics to identify potential biomechanical, physiological, and behavioral markers of panic attacks.\nOne  in  10  people  have  experienced  a  panic  attack,  a debilitating psycho-physiological state wherein people experience  heart  palpitations,  shortness  of  breath,  and feel  out  of  control  of  their  own  bodies.  We  have  daily Apple Watch data on 90 individuals who regularly suffer from  panic  attacks.  We  will  develop  models  to  predict when panics attacks will occur to ultimately inform digital interventions to warn folks and engage them in prevention strategies.\nThe student will: 1) review literature 2) manage data from a  study  including  more  than  300  panic  attacks,  and  3) leverage  machine  learning  to  identify  predictors  of  nextday panic attacks.\nRyan McGinnis, PhD\nAssociate Professor Department of Biomedical Engineering Center for Remote Health Monitoring Wake Forest University School of Medicine\nEllen McGinnis, PhD\nAssistant Professor Division of Public Health Sciences Center for Remote Health Monitoring Wake Forest University School of Medicine\nWake Forest University School of Medicine ChAMP\nProject 15 - Summer 2026\nDetecting Anxiety and Depression in Young Children\nThis  project  will  leverage  digital  health  technologies  (i.e.,  wearables,  mobile  apps)  and  AIbased informatics to identify potential biomechanical, physiological, and behavioral markers of anxiety and depression in young children.\nIt  has  just  been  recommended  that children  be screened  for anxiety at pediatric  well visits. However, we currently do not have brief, accurate, objective screening tools to detect mental health disorders in young children. We have multimodal wearable sensor data during 3 brief laboratory tasks from 100 preschoolers with and without mental health diagnoses. We aim to develop models to detect disorders from sensor data and to examine parent and child factors that may moderate accuracy.\nThe  student  will:  1)  review  literature  2) manage  data  from  a  100-child  study  3) leverage machine learning to identify indicators  of  diagnoses  and  4)  conduct statistical  tests  to  identify  survey  and  IQ data that may moderate models\nRyan McGinnis, PhD\nAssociate Professor Department of Biomedical Engineering Center for Remote Health Monitoring Wake Forest University School of Medicine\nEllen McGinnis, PhD Assistant Professor Division of Public Health Sciences Center for Remote Health Monitoring Wake Forest University School of Medicine\nd\n7\nShoulder Force\nWake Forest University School of Medicine\nProject 16 - Summer 2026\nUnderstanding Pitching Efficiency\nBaseball  throwing  and  pitching  is  a  multifaceted,  intricate  movement  pattern  that  results  in  high forces  and  torques  throughout  the  body.  During  the  pitching  motion,  the  body  is  considered  a kinetic chain. The lower extremities generate force that is transferred through the trunk, arm, and ultimately to the hand to propel the baseball. Disruption or inefficiency within this chain increases arm stress and injury risk. It is well known that pitching velocity is related to arm stress. Therefore, the  faster  a  pitcher  throws  the  greater  their  risk  of  injury.  However,  there  are  also  pitching biomechanics and other variables that influence arm stress, pitch velocity, and ball metrics. The goal of  the  Wake  Forest  Pitching  Laboratory  is  to  find  this  balance  between  minimized  injury  risk  and maximized performance -deemed pitching efficiency.\nThe  student  will:  1)  review  literature  on pitching biomechanics 2) collect 3D motion capture data of baseball pitchers, and 3) analyze the influence of kinematics, fatigue, strength, and/or functional movement  on  arm  kinetics,  ball  velocity, and  ball  metrics. The  student  will  apply skills they learn in human subjects' research, experimental design, data collection  and  processing,  biomechanics and  human  movement, and statistical analysis to better understand pitching efficiency.\nKristen Nicholson, PhD\nAssociate Professor, Orthopedic Surgery Wake Forest Baptist Health Medical Center Boulevard Winston-Salem, NC 27157\n2S\n/e\n1\nWake Forest University\nSchool of Medicine\nProject 17 - Summer 2026\nCrash Injury Research and Engineering Network (CIREN)\nCIREN  is  a  research  catalyst  that  can  be  used  to  conduct  a  wide  range  of  motor  vehicle trauma studies.  It has been an ongoing project at WFUBMC since 2005.\nThe student will: 1) conduct detailed investigations of real-world motor vehicle crashes and determine mechanism and causation of occupant injuries to improve prevention, mitigation, and treatment of motor vehicle crashes, 2) collaborate and work closely with a broad range of medical specialties, including biomedical engineers, crash investigators,  radiologists,  orthopedic  surgeons, and  trauma  surgeons,  and  3)  conduct  finite element (FE) modeling reconstructions of CIREN crashes  using  the  simplified  GHBMC  human body model of a simplified vehicle model providing kinematic visualizations and injury analyses to supplement our investigations.\nJoel Stitzel, PhD\nProfessor & Chair, Biomedical Engineering Program Leader & Director, WFU Campus VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101 www.CIB.vt.edu\n2S\n/e\n1\nDriver FE Model\nWake Forest University\nSchool of Medicine\nFE Simulation for\nDriver Safety Optimization\nProject 18 - Summer 2026\nHead Impact Exposure Quantification and Mitigation in Motorsports\nExample On-Track Impacts\nThe  Pilot  testing  of  individualized  mouthpiece  deployment  in  motorsports  involving  injury risk assessment for the optimization of safety measures\n-1540\nThe  student  will: 1)  conduct  analysis  to quantify environmental and crash head kinematics, 2) utilize finite element  (FE) modeling for injury risk assessment for drivers in crash scenarios, and, 3) FE simulation to optimize safety measures and driver comfort.\nJoel Stitzel, PhD\nProfessor & Chair, Biomedical Engineering Program Leader & Director, WFU Campus VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101 www.CIB.vt.edu\n2S\n/e\n1\nAcce e ration g\n40\nWake Forest University\nSchool of Medicine\n1111\nProject 19 - Summer 2026\n40\nSubconcussive Head Impact Analysis using Instrumented Mouthpiece Data\nSensor technology offers researchers and consumers the ability to collect head impact data in  the  real-world;  however,  the  accuracy  of  such  sensors  has  been  limited.  This  project involves development, testing, and field deployment of a novel instrumented mouthpiece in contact sports (e.g. football, gymnastics, soccer, hockey) and everyday activities (e.g. sitting, running).\nThe  student  will:  1)  review  literature  on  head kinematics  in  athletic  and  everyday  activities, and 2) work on a project to evaluate kinematic data collected from the mouthpiece. The student  will  apply  skills  they  learn  in  human subjects'  research,  experimental  testing,  data collection and  processing,  statistical analysis, and  FE  modeling  with  a  brain  model  to  derive conclusions and a better understanding of head kinematics  and  TBI  risk  in  sports  and  everyday activities.\nJoel Stitzel, PhD\nProfessor & Chair, Biomedical Engineering Program Leader & Director, WFU Campus VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101 www.CIB.vt.edu\nWake Forest University\nSchool of Medicine\nProject 20 - Summer 2026\nEvidence-Based Intervention for Improved Head Impact Safety in Youth Sports\nDue  to  rising  concern  of  head  impact  exposure  and  concussion  in  the  21  million  children involved in team sports, this project aims to examine the sub-concussive and concussive head impact exposure in adolescent athletes instrumented with mouthpiece sensors and evaluate the effectiveness of evidence-based intervention programs in youth sports.\nThe  student  will:  1)  review  literature  focused  on cumulative exposure of sub-concussive and concussive  head  impacts  and  factors  influencing exposure  (e.g.  coaching  techniques;  practice  and game guidelines/rules; community-based interventions;  athlete  age,  size,  experience,  and position), and 2) design a hypothesis-driven experiment  to  examine  metrics  of  head  impact exposure using on-field video analysis, biomechanical data processing, and statistical approaches  learned  from  mentored  training.  The student will directly contribute to the  broader research goal of reducing sub-concussive and concussive head impact exposure to improve sport safety in adolescents\nJillian Urban, PhD, MPH\nAssociate Professor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nhttp://www.wakehealth.edu/CIB/CIB-People.htm\ny in amic\nst be may\nman suit\n• can\n5\n, the jury\nch as shed\ndels asks\nNeck & Lumbar Spine Injury Risk Curve Development for Spaceflight Applications\nInjury prediction and prevention in domains analogous to spaceflight dynamic events commonly rely on the use of anthropomorphic  test  devices  (ATD),  also  known  as  crash  test dummies.  While  ATDs  have  been  effective  in  reducing  injury  in several domains, their use is limited in spaceflight as the dynamic events often involve the use of a seat or space suit that may not be compatible with the ATDs, and the dynamic events themselves may not be reproducible in a laboratory setting. Finite element human body models, on the other hand, can be outfitted with a space suit and fit  into  any  seat  design  that  may  be used. These  models can then predict the loads, accelerations, etc., of the body during the dynamic phases  of  flight.  However,  the  acceptable  level  of  injury risk in spaceflight is much lower than in analogous domains such as the automotive industry. There are currently no established thresholds for which loads on these human body models correspond to these lower levels of injury probability. These tasks seek to identify these thresholds, also known as injury assessment reference values (IARVs), for the neck and lumbar spine.\nschool.wakehealth.edu/faculty /d/karan-shamrao-devane\nAssistant Professor, Biomedical Engineering Karan Devane, PhD\nVT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nAshley Weaver, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nAshley Anne Weaver, PhD | Wake Forest University School of Medicine\nWake Forest University\nSchool of Medicine V\nK\n5\nProject 21 - Summer 2026\nCS\n2S\n1\nle\nHealthy Male\nWake Forest University\nSchool of Medicine\nProject 22 - Summer 2026\nMale with Diabetes &\nHigh-Resolution Peripheral Quantitative Computed Tomography (HR-pQCT) Scanning in Clinical Trial Interventions\nThe XtremeCT II HR-pQCT scanner provides highly specialized CT  scans  at  the  distal  radius  and  tibia.  These  images  can  be used to quantify changes in volumetric bone mineral density (BMD)  as  well  as  structural  changes  by  providing  detailed resolution of the bone microarchitecture.\nThese data are being used by our group in the clinical setting as part of interventional trials designed to evaluate the outcome of varying  weight  loss  modalities  (dietary,  exercise,  surgical)  on metrics  of  bone  health.  The  ability  to  see  microarchitecture remodeling  may  lead  to  an  increased  understanding  of  how bones  are  affected  by  weight  loss,  particularly  among  older adults.\nThe  student  will:  develop  HR-pQCT  scanning  and  analysis protocols, assist with HR-pQCT scanning of participants, and analyze HR-pQCT scan to extract bone microstructure properties (e.g., trabecular spacing, cortical porosity, trabecular and cortical BMD, finite element estimated failure load and bone stiffness) to explore how clinical trial interventions alter the skeleton.\nAshley Weaver, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics School of Biomedical Engineering and Sciences\n575 N. Patterson Ave Winston-Salem, NC 27101\nAshley Anne Weaver, PhD | Wake Forest University School of Medicine\ne\nCS\n2S\n1\nle\nMuscle CSA: 223 cm?\nIntermuscular Fat: 8%\nRadiomic Textures\nMuscle CS.A: 174 cm?\nIntennuscular Fat: 14%\nMuscle Quality/Radiomics Features and Muscle-Bone Crosstalk\nLoss of muscle mass and strength can lead to mobility disability and increase risk of osteoporosis and fracture  as  muscle  acts  both  mechanically  and  biochemically  on  bone.  We  are  conducting  studies utilizing computed tomography (CT) and magnetic resonance (MR) imaging to assess muscle changes with  weight  loss  (diet/exercise-based  or  bariatric  surgery),  disease  (e.g.  myotonic  dystrophy;  heart failure),  or  normal  aging.  We  apply  automated  machine-learning  and  semi-automated  methods  to assess changes in muscle area, volume, quality, and intermuscular fat in CT and MR scans.\nWe  also  use  automated  radiomics  analysis  to extract high-dimensional muscle quality measures, such as uniformity, heterogeneity, randomness,  and  repetitive  patterns  from  CT. These  muscle  properties  can  be  correlated  to bone  mineral  density  and  bone  strength,  which we  derive  from  imaging.  These  analyses  assess effectiveness of interventions, characterize mechanisms of disease, identify therapeutic targets, and will help establish imaging biomarkers to predict musculoskeletal decline.\nThe  student  on  this  project  will  be  trained  in image segmentation and pipelines for quantifying  muscle  properties  from  radiology. The student will examine muscle quality/radiomics  features  in  a  human  subject population and explore how these features are affected by a clinical trial intervention or disease such as myotonic dystrophy.\nMyotonic Dystrophy\nAshley Weaver, PhD\nProfessor, Biomedical Engineering VT-WFU Center for Injury Biomechanics\nSchool of Biomedical Engineering and Sciences 575 N. Patterson Ave\nWinston-Salem, NC 27101 Ashley Anne Weaver, PhD | Wake Forest University School of Medicine\nRadiomic Textures\nWake Forest University School of Medicine Muscle CSA: 102 cm? Internuscular Fat: 19%\nMuntonis Nuctunnhy\nProject 23 - Summer 2026\neS\n1\nEstimated myocardial stiffness\nWake Forest University time\nSchool of Medicine Imaging time series\nCine CMR\nCancer treatment-related cardiotoxicity\nLeft ventricular biomechanical model\nthroughout diastole\nProject 24 - Summer 2026\ndeformation\nPredicting Cancer Treatment-Related Cardiotoxicity by Imaging Cardiac Mechanical Stiffness\nCancer treatment-related cardiotoxicity is a significant concern for cancer survivors. Increased survival rates along with a younger  demographic  shift  makes  patient  survivorship issues, particularly cardiovascular disease, a forefront of clinical concern in an important patient group with decades of life  to  protect.  Cardiotoxicity  concerns  limit  therapeutic  options  and  offset  expected  therapeutic benefits. Current clinical detection  paradigms are based on semi-quantitative and subjective assessments that are only able to detect late-stage irreversible cardiac decline. There is a compelling need for new methods to assess early cardiac dysfunction to allow for interventional opportunities to minimize  cancer  therapy-induced  cardiotoxicity  while  maximizing  cancer  treatment  effect.  We  have recently  shown  the  development  of  novel  myocardial  mechanical  stiffness  phenotyping  tools.  This project  seeks  to  further  develop  and  optimize  biomechanical  model-embedded  cardiovascular magnetic resonance imaging (CMR) assessment of myocardial mechanical elasticity to accurately and non-invasively detect cancer treatment-related changes in left ventricular stiffness as an early indicator of cardiac dysfunction to inform therapeutic management strategies for breast cancer patients prior to irreversible cardiovascular damage.\nThe student will gain experience with medical image processing (segmentation, registration) and biophysical finite element modeling based on  MRI  data.  The  student  will  develop  and deploy  computational  analysis  pipelines  and contribute to the development of computational model-based image analysis methodologies to guide interventional therapy for cancer survivors.\nJared Weis, PhD\nAssociate Professor, Biomedical Engineering School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nhttp://www.weislab.org/\neS\n1\nIntestinal photoacoustic imaging (PAI) in premature infants absorption causes\nWake Forest University Light In: light pulses at specific wavelengths excite molecules\nSchool of Medicine Sound Out: optical\nthermoelastic expansion of excited molecules and\nemits ultrasound waves\nProject 25 - Summer 2026\nPhotoacoustic Imaging for Biophysical Physiological Indicators of Infant Intestinal Health and Necrotizing Enterocolitis\nNecrotizing enterocolitis (NEC) is a devastating intestinal disease affecting the most fragile premature infants, with mortality rates that persist at 20 - 40%. Accurate and conclusive early diagnosis of NEC remains  elusive, with  limited diagnostic confidence  complicating  timely  and  effective  medical management efforts to prevent disease progression to urgent surgical removal of necrotic intestine. We have recently pioneered the translational use of photoacoustic imaging for characterizing intestinal physiological  health  in  infants.  Our  current  research  goals  focus  on  developing  and  validating  these novel in vivo photoacoustic imaging methods in both humans and animal models of intestinal diseases affecting premature infants. This is an interdisciplinary research project that integrates gastrointestinal cell biology/physiology and biomedical imaging/analysis tools to explore the mechanistic underpinnings of an emerging new diagnostic imaging method for premature infant intestinal diseases\nThis project is a highly collaborative team science effort to advance a promising and translationally relevant diagnostic imaging tool with collaborators across the departments/sections of Biomedical  Engineering,  Regenerative  Medicine, Neonatology, Pediatric Surgery, Pediatric Radiology, Comparative Pathology, and Biostatistics.  The  student  will  gain  experience with ultrasound and photoacoustic image processing  and  histopathological  tissue  staining techniques used for validation of the cellular and molecular origins of changes in imaging signatures.\nJared Weis, PhD\nAssociate Professor, Biomedical Engineering School of Biomedical Engineering and Sciences 575 N. Patterson Ave Winston-Salem, NC 27101\nhttp://www.weislab.org/\n70-\n65\n601\nVolume/Surface Area\n50-\nWake Forest University Anterior\nSchool of Medicine\nAnterior\nVivarium Control\nPosterior\nHU - FEMALES\nFLIGHT\nPosterion\nHLU - MALES\nProject 26 - Summer 2026\n55-\nThe Mouse Housing Unit-8 Mission to the International Space Station: Prevention of Skeletal Complications\nLoss of bone, cartilage, and muscle during periods of microgravity in space serves as a challenge to astronaut health during and after the mission. Our previous spaceflight data (from the International Space Station and Space Shuttle) identified damage to soft (cartilage, menisci) and hard (bone) joint tissues.  Our  group  is  again  part  of  a  team  of  investigators  examining  spaceflight  affects  on musculoskeletal health. Our team is examining if artificial gravity and/or spaceflight-relevant radiation exposure can protects against spaceflight environment-induced damage to bone and joint tissues.\nThis spaceflight mission for our REU team member involved sending mice to the International Space Station  in  March,  2023,  and  also  that  were  exposed  to  spaceflight  radiation  at  the  NASA  Space Radiation Lab. For the spaceflight study, we exposed the mice to continuous artificial gravity as via centrifugation aboard the ISS, as part of a joint study between NASA and the Japanese Space Agency. Mice received different gravitational levels, including near 0G, 0.67G, 0.33G (Martian), and 1G, to see if  artificial  gravity  could  project  against  skeletal  damage.  Likewise,  rodents  were  exposed  to spaceflight radiation and / or simulated microgravity.\nThe  REU  student  will have  the opportunity to perform skeletal-related analyses across tissues. We are  interested  in  a  team  member  who  can  help establish  mechanical  testing  (e.g.,  using  AFM  or other approaches)  to  identify whether  cartilage mechanics are altered during/after spaceflight, with/without artificial gravity, and/or after exposure to spaceflight radiation, although we can be flexible with engineering and biologic approaches.\nJeffrey Willey, PhD\nProfessor, Radiation Oncology Wake Forest University School of Medicine Medical Center Boulevard Winston-Salem, NC  27157\nhttp://www.wakehealth.edu/Faculty/Willey-Jeffrey-Scott.htm\nGround Control\nAnterior\nPosterion\nRR9\n60-\n55-\nIzation algorithms for real w ction.\n1: 6\nElemance er\nC\nC\nWake Forest University\nSchool of Medicine\nProject 27 - Summer 2026\nRapid Design and Optimization of Personal Protective Equipment to Mitigate Warfighter Injury Risk\nBackground: The modern United States warfighter is equipped with a sophisticated suite of personal protective equipment  (PPE).  However,  the  complexity  of  modern  PPE  and  the  variety  of  design  criteria,  certification requirements, and performance considerations require a labor intensive and experimentally demanding design process. Adding to these difficulties are the lack of suitable and accessible human surrogates for translating the effectiveness of PPE in testing to prediction of real-world performance for military personnel in theater. Advanced digital engineering tools are poised to fill gaps in the current PPE design process and facilitate both expedited and more comprehensive design analyses. One key tool available in the digital design space to serve this purpose is the computational Finite Element (FE) Human Body Model (HBM). Another key tool is probabilistic methodologies to facilitate  uncertainty quantification and optimization. The objective of this project is to develop a digital design tool  capable  of  rapid  design  exploration  of  PPE  through  the  coupling  of  state-of-the-art  HBMs  with  advanced probabilistic and optimization techniques. The proposed software solution will provide manufacturers with a tool to  accelerate  the  PPE  design  cycle  while  also  making  performance  more  focused  on  relevant  real  world  injury reduction.\nStudent Activities:\nThe student will gain experience in…\nDeveloping desktop applications, including interactive 3D visualizations of human body models and PPE designs\nPost -processing finite element simulations of human body models and calculating relevant biomechanical metrics for injury risk analysis\nUtilizing machine learning models and optimization algorithms for real world PPE applications\nLocation:\nTanner Filben, PhD\nResearch Engineer Elemance, LLC Winston-Salem, NC\nZach Hostetler, PhD\nSenior Engineer Elemance, LLC Winston-Salem, NC\n2 o'clock to 3 o'clock\nR\nRV\nAI\nTricusple zaive RA\nLV\nST\nLA\nWake Forest University\nSchool of Medicine\nbutral valve\nProject 28 - Summer 2026\nMedical Image Generation from Physiological Signals\nMedical imaging modalities, such as echocardiogram, computed tomography, or cardiac magnetic resonance, typically forms the gold standard diagnostics for most cardiovascular diseases. However, such images are associated with high cost  and  low  accessibility  limiting their  utility  in  cardiovascular  diseases screening purposes. On the other hand, electrocardiogram is significantly more frequently  recorded  and  widely  accessible,  yet,  it  is  not  satisfactory  for  gold standard  diagnosis  of  most  diseases.  Hence,  there  is  a  need  for  artificial intelligence  tools  to  convert  information  in  ECG  signals  into  rich  information gathered from these cardiac imaging modalities.\nThis research effort will be in the Department of Cardiovascular Medicine and the Center for Artificial Intelligence. The intern will be provided with data and computational  resources  to  develop  AI  models  that  can  1)  estimate  imaging parameters from ECG and 2) to construct images from ECG signals.\nOguz Akbilgic, PhD\nProfessor, Artificial Intelligence Department of Cardiovascular Medicine Wake Forest University School of Medicine 486 N. Patterson Ave\nWinston-Salem, NC 27101\noguz.akbilgic@advocatehealth.org https://www.linkedin.com/in/oguz-akbilgic-a385ba37/\nase le\n7\ncolisuel\nMetabolomics\nGenetics\nWake Forest University\nSchool of Medicine\nProject 29 - Summer 2026\nAssociation Analysis\nInvestigating the Genetic Architecture of the Metabolome to Provide Insight into Cardiometabolic Disease Risk\nMetabolomic profiles  are  highly  informative  of  an individual's functional  state  and  capture  the interaction  of  cellular  processes  and  environmental  exposures  to  promote  disease.  Highthroughput profiling has implicated multiple metabolites in cardiometabolic disease risk, e.g. type 2  diabetes  (T2D)  and  obesity.  Minority  populations  experience  a  disproportionate  burden  of cardiometabolic  disease;  however,  studies  in  these  populations  have  been  few  in  number  and limited in scope.\nMetabolomics\nGenetics\nLinkage Analysis\nAssociation Analysis\nCardiometabolic Disease\nGoal :  Provide  a  comprehensive  survey  of  the genetic architecture of untargeted metabolomics data. Data include 1274 plasma metabolites with  genetic  data  drawn  from genome-wide array, whole exome sequencing and whole genome sequencing. Methods to be incorporated include family-based linkage analysis  and  variance  components  models  to test for association.\nExpectation: The student working on this project will be trained on the implementation of statistical analysis packages  relevant  for linkage,  association  and  plotting  of  results. Results will be contextualized using the relevant literature for implication in cardiometabolic disease states. Students interested in genetics, statistics and cardiometabolic disease should consider applying.\nNicholette D. (Palmer) Allred, PhD\nProfessor, Biochemistry Wake Forest University School of Medicine Atrium Health Wake Forest Baptist Medical Center Boulevard Winston-Salem, NC 27157\ne\nE\ne\nb\nLobar Consolidation\nAtelectasis\nFine Nodular\nWake Forest University\nSchool of Medicine Multifocal ill defined\nDiffuse Consolidation\nFine Reticular Interstitial\nSolitary Pulmonary Nodule\nCoarse Reticular Interstitial\nProject 30 - Summer 2026\nAnomaly Detection in Lung X-rays\nThe timely and accurate diagnosis of lung abnormalities from chest X-rays is a critical factor in  patient  outcomes.  Chest  X-rays  are  one  of  the  most  common  diagnostic  imaging  tests, capable of revealing a wide range of conditions including cancer, pneumonia, and collapsed lungs. However, the interpretation of these images can be challenging and subject to human error,  with  missed  lung  nodules  being  a  predominant  cause  of  malpractice  claims  in  chest imaging.\nDeep learning has emerged as a powerful tool in medical image analysis, with the potential to improve the accuracy and efficiency of diagnoses. This project aims to develop a robust and interpretable  deep  learning  framework  to  automatically  detect and classify various anomalies in chest X-ray images. By automating  this  detection  process,  we  can  create  a  low-cost, scalable  tool  to  assist  radiologists,  prioritize  urgent  cases,  and ultimately improve patient care.\nLearning Objectives:\nGain hands-on experience with deep learning for medical image analysis.\nLearn and apply computer vision techniques on lung pathologies.\nWork with large-scale, real-world chest X-ray datasets and address challenges such as class imbalance and data variability.\nDevelop skills in model validation and interpretation in a clinical context.\nExpectation\n: Good programming skills in python, familiarity with\nPyTorch and basic knowledge of Machine learning/Deep learning.\nMetin Gurcan, Ph.D.\nSenior Associate Dean for Artificial Intelligence\nDirector, Center for Artificial Intelligence Research (CAIR) Professor, Department of Internal Medicine, Pathology, BME Wake Forest University School of Medicine https://school.wakehealth.edu/research/labs/clinical-image-analysis-lab\ne\nE\ne\nb\nWake Forest University\nSchool of Medicine\nProject 31 - Summer 2026\nOtoscopy Assistant Diagnosis System with Integrated Classification and Out-of-Distribution Detection\nEar diseases are highly prevalent worldwide and often require expert evaluation of otoscopic images  and  videos  for  accurate  diagnosis.  However,  variations  in  image  quality,  patient anatomy,  and  disease  presentation  make  automated  analysis  challenging.  This  project focuses on developing an advanced assistant diagnostic system for otoscopy by combining disease classification with out-of-distribution (OOD) detection.\nThe classification component aims to train state-of-the-art deep learning models to accurately identify common otologic conditions such as effusion, perforation, and infection. Simultaneously, the OOD detection module will identify samples that fall outside the distribution of the training dataset, such as images of rare diseases, poor-quality frames, or ambiguous cases that  are  difficult even  for  clinicians  to  diagnose.  This  dual approach ensures that the system can not only provide reliable predictions for known conditions but also flag uncertain or novel cases  for  further  expert  review,  thereby  increasing  safety  and trustworthiness in clinical applications.\nLearning Objectives:\nGain hands-on experience with deep learning for medical image\nNormal\nPerforation\nand video analysis. Learn techniques for out-of-distribution detection, uncertainty quantification, and trustworthy AI. Work with real-world otoscopy datasets and experience challenges such as image quality variability and dataset imbalance.\nExpectation : Good programming skills in python, familiarity with PyTorch or TensorFlow and basic knowledge of Machine learning.\nMetin Gurcan, Ph.D.\nSenior Associate Dean for Artificial Intelligence Director, Center for Artificial Intelligence Research (CAIR) Professor, Department of Internal Medicine, Pathology, BME Wake Forest University School of Medicine https://school.wakehealth.edu/research/labs/clinical-image-analysis-lab\nLow quality (normal)\nUdsIC\nryloren ana basic\nWake Forest University School of Medicine У У 4 y 11\nProject 32 - Summer 2026\nStructuring and Standardizing Patient Discharge Notes\nPatient discharge summaries and notes often vary depending on the hospital, region, and the individual physician's documentation style. These differences can make it difficult to quickly capture  key  information  when  a  patient  is  transferred  to  another  department  or  hospital. This  project  aims  to  create  a  more  systematic,  standardized  structure  for  patient  notes  to ensure critical information is easier to find and interpret across different settings.\nSignificance\nInconsistent  documentation  formats  across  hospitals and  regions  can  lead  to  missed  critical  information, delayed care, and unnecessary repetition of tests. By standardizing the structure of discharge and anamnesis notes, this project will improve continuity of  care,  prevent  oversight  of  life-saving  details,  and make patient follow-up more systematic and efficient.\nLearning Objectives:\nTo  develop  and  validate  a  Natural  Language  Processing  (NLP)  model  capable  of  accurately identifying and extracting key clinical entities from unstructured, free-text discharge notes. These entities include diagnoses, medications, procedures, allergies, lab results, and followup plans To evaluate the effectiveness of the AI-generated standardized notes by measuring reductions in documentation time for physicians and improvements in information retrieval accuracy by receiving clinicians. To assess the impact of the standardized notes on patient safety metrics, such as medication errors and hospital readmission rates.\nExpectation :  Good  programming  skills  in  python,  familiarity  with  PyTorch  and  basic knowledge of Machine learning/Deep learning.\nMetin Gurcan, Ph.D.\nSenior Associate Dean for Artificial Intelligence Director, Center for Artificial Intelligence Research (CAIR) Professor, Department of Internal Medicine, Pathology, BME Wake Forest University School of Medicine https://school.wakehealth.edu/research/labs/clinical-image-analysis-lab\ne\nE\ne\nb\ne\nE\ne\nb\nWake Forest University\nSchool of Medicine\nProject 33 - Summer 2026\nPredicting Breast Cancer Recurrence From H&E-Stained Whole Slide Images\nThe risk of disease recurrence is a critical factor in determining the course of treatment for breast  cancer  patients.  While  genomic  assays  like  Oncotype  DX  provide  recurrence  risk scores,  they  are  expensive  and  not  universally  available.  Histopathological  examination  of H&E-stained tissue slides remains the cornerstone of diagnosis, and these images contain a wealth of morphological information that correlates with tumor aggression and, ultimately, recurrence risk.\nHowever, a pathologist's visual assessment of recurrence risk is inherently subjective and based on integrating a complex set of features like tumor grade, mitotic activity, and the nature of the tumor-immune interface. This project aims to develop a robust and interpretable deep learning framework to objectively predict breast  cancer  recurrence  directly  from  standard  H&E-stained Whole  Slide  Images  (WSIs).  By  automating  this  prediction,  we can create a low-cost, scalable tool to augment clinical decisionmaking and better stratify patients.\nLearning Objectives:\nGain hands-on experience with deep learning for medical image analysis. Learn techniques for object detection, segmentation, and multi-instance learning. Work with real-world histopathology datasets and experience challenges such as image stain variability and dataset imbalance.\nExpectation : Good programming skills in python, familiarity with PyTorch and basic knowledge of Machine learning/Deep learning.\nMetin Gurcan, Ph.D.\nSenior Associate Dean for Artificial Intelligence Director, Center for Artificial Intelligence Research (CAIR) Professor, Department of Internal Medicine, Pathology, BME Wake Forest University School of Medicine https://school.wakehealth.edu/research/labs/clinical-image-analysis-lab\nBreast WSI Tiles\ne\nE\ne\nb\nWake Forest University\nSchool of Medicine\nProject 34 - Summer 2026\nNuclei and Tissue Segmentation in Whole Slide Histology Images\nPathology slides contain a wealth of information that is essential for accurate diagnosis. This project focuses on developing a model that can automatically detect whether a slide contains pathological findings, even spotting abnormalities that the human eye might miss. In places where pathologists are not available, diagnosis can be delayed, which affects treatment decisions and patient outcomes. This project aims to support healthcare teams by providing a reliable, AI-powered screening tool that speeds up the process and helps ensure no critical findings are overlooked.\nOur Approach:\nWe will use a dataset of H&E-stained Whole Slide Images (WSIs) and apply deep learning based segmentation algorithms to identify nuclei and tissue regions. These segmented regions will then be analyzed with classification models to determine whether the slide shows any pathological features.\nLearning Objectives: Key learning objectives include implementing\nsegmentation models to identify nuclei and tissue regions and developing classification models to detect pathological features. The primary expectation is to build, train, and quantitatively evaluate a complete AI pipeline for automated slide analysis, culminating in a functional and well-documented system.\nExpectation: The participant is expected to gain hands-on experience in digital pathology by applying deep learning algorithms to H&E-stained Whole Slide Images (WSIs).\nMetin Gurcan, Ph.D.\nSenior Associate Dean for Artificial Intelligence Director, Center for Artificial Intelligence Research (CAIR) Professor, Department of Internal Medicine, Pathology, BME Wake Forest University School of Medicine https://school.wakehealth.edu/research/labs/clinical-image-analysis-lab\nlea uL models by spatial perspecuives of the Input adla (clu).\nr\neS.\nDL\n12 Lead ECG\nWake Forest University 64.3.2 64,3,2 16.3,1 32311 32,1,2 64,1,2\nSchool of Medicine\nInput\nConviD\nBatch\nNormalization\nLeaky RELU\nAdd\nMax Pooling\nDropout\nFlatten\nProject 35 - Summer 2026\nNovel Deep learning Algorithms and Explainable AI on ECG\nBackground : In Deep Learning (DL), there are various types of layers that are specialized for specific tasks. For example, the convolutional layers slides over the input (image or its representation) spatially to extract features. However, there is still a gap in the literature to design a DL layer for ECG specific. And the black-box side of the DL is still an open-research area, specifically for ECG based models.\nGoal : The goal of this project is to build ECG inputted novel DL algorithms (layers, activation functions, or architecture based) for prediction/classification of cardiovascular diseases. And the other goal is to uncover the black-box side of ECG fed DL models by spatial perspectives of the input data (ECG).\nExpectation : The student in this project will is expected to have Python programming skill and work on 1) building novel DL algorithms fed by ECG 2) design infrastructure to uncover the black-box of ECG fed DL models, 3) compare results with state-of-the art algorithms\nIbrahim Karabayir, PhD\nAssistant Professor, Wake Forest University Health Science Internal Medicine, Section on Cardiovascular Medicine Center for Artificial Intelligence Research (CAIR) Wake Forest University School of Medicine\nS\nal te\nWake Forest University\nSchool of Medicine\nT G\nCÃA\nProject 36 - Summer 2026\nLanguage-based AI Model on Genomic Data to Understand and Predict risk of Alzheimer Disease and Multimorbidity\nBackground : Our Genomes such as DNA encode molecular-level information about disease risk. Traditional methods using polygenic risk scores only explore the risk of a single disease for every single gene, omitting the high-level genetic interaction of genomic sequences that are associated with multiple diseases. The recent development of the Natural Language Processing (NLP) model has shown success in the comprehension of high-level context in sequence data such as sentences. Similarly, NLP models can also be applied to genomic sequences to extract high-level genotype information for multiple related diseases. However, studies in this field is still limited despite the strong potential.\nGoal : The goal of this project is to 1) develop novel NLP-based deep learning models on genomic data to predict the composite risk for multiple diseases.\nExpectation : The student in this project will be expected to have Python programming skills and work on 1) developing representation learning models to extract high-level genomic features 2) predicting multi-disease risk factors and identifying high-level genomic associations.\nDa Ma, PhD\nAssociate Professor,\nGerontology and Geriatric Medicine Center for Artificial Intelligence Research (CAIR)\nMichael Horvath, MS\nLead Programmer / Analyst, Clinical and Translational Science Institute\nAlzheimer's Disease Research Center\nWake Forest University School of Medicine https://school.wakehealth.edu/faculty/m/da-ma\nWake Forest University School of Medicine\nProject 37 - Summer 2026\nMultimodal System for Early Identification of Cardiovascular Diseases\nCardiovascular diseases (CVDs) are the leading cause of death globally. Many forms of CVDs are progressive and develop over time. Early identification and guided treatment may assist to manage the disease and reduce the burden. In this project, we will collect data from patients and analyze data to identify early signs of CVDs. We will develop a multimodal system to record different signals  such  as  temperature,  blood  pressure  and  ECGs  from  patients  and healthy subjects. We will analyze data to find abnormalities associated with CVDs.\nThe  student  will:  1)  review  literature  on vital signs analysis, 2) develop a multimodal  system,  3)  collect  data  from patients and healthy subject, and 4) analyze data to find abnormalities.\nBackground in electronic circuits, statistical analysis and hands-onexperience with electronic equipment will be essential for this project.\nMohammad Moghimi, PhD\nAssistant Professor, Department of Biomedical Engineering Center for Artificial Intelligence Research (CAIR) Center for Remote Health Monitoring Wake Forest University School of Medicine\n575 Patterson Ave, Suite 120 Winston-Salem, NC 27101\nmanagement Increase the chance or successtul treatment ana reauce the burden.\nWake Forest University In this project, we will develop a wearable patch that can be used by individuals out of clinical setting to evaluate the risk of melanoma on decolored parts of skin\nSchool of Medicine\nMedical Tape\nProject 38 - Summer 2026\nWearable Flexible Patch for Early Identification of Melanoma\nMelanoma is the most malicious type of skin cancer, and the incidence was on rise in  the  last  decades.  In  the  United  States  alone,  97,610  new  cases  of  melanoma were  diagnosed  in  2023,  and  mortality  rate  was  7,9901.  Melanoma  may  leave marks  on  skin  and  cause  cosmetic  issues  for  the  patients.  As  the  tumor  grows, melanoma  may  metastasize  and  result  in  death.  Early  identification  and  timely management increase the chance of successful treatment and reduce the burden. In this project, we will develop a wearable patch that can be used by individuals out of clinical setting to evaluate the risk of melanoma on decolored parts of skin and lesions.\nThe  student  will:  1)  review  literature  on melanoma detection, 2) optimize the flexible patch, 3) collect data from lesions, and  4)  analyze  data  from  benign  and malignant tumors.\nBackground in electronic circuits, statistical analysis and hands-onexperience with electronic equipment will be essential for this project.\nWearable patch placed on a lesions\n2 cm\nPatch\nMedical Tape\nPatient\nMohammad Moghimi, PhD\nAssistant Professor, Department of Biomedical Engineering Center for Artificial Intelligence Research (CAIR) Center for Remote Health Monitoring Wake Forest University School of Medicine\n575 Patterson Ave, Suite 120 Winston-Salem, NC 27101\nPatch and lesions.\nWake Forest University\nSchool of Medicine\nProject 39 - Summer 2026\nAI-Assisted Pre-screening for Neurological Disorders\nNeurological  disorders  (NDs)  are  the  number  one  cause  of  disability  and  the second leading cause of death globally. Evidence is emerging showing that NDs are in fact multi system syndromes affecting different aspects of patients' health and  well-being. Early diagnosis enables  access to timely intervention  and therapeutics. However, diagnosis of most NDs is challenging due to heterogeneity of disease and lack of evident physical phenotypes. The goal of this project is to use advanced artificial intelligence (AI) techniques to assist the diagnostic process and characterize the clinical risk associated with NDs.\nThe  student  will:  1)  review  literature  on prevalence and diagnosis of different neurological  disorders,  2)  evaluate  the previously trained model on a new dataset,  3)  evaluate  the  model  across various patient subgroups defined by race/ethnicity,  sex,  and  co-occurrence  of key  diagnosis.  This  data  will  inform  the development of more accurate and inclusive AI-assisted pre-screening models for neurological disorders  which  could lead  to  more  equitable  diagnosis  and health care for patients.\nArezoo Movaghar, PhD\nAssistant Professor, Department of Pediatrics Center for Artificial Intelligence Research (CAIR) Wake Forest University School of Medicine\nMeads Hall, Queen St., Medical Center Blvd. Winston-Salem, NC 27103\nAAATCATGCGCAT\nGTCAAATATACAT\nGCGCATGCGGTA.\nAAGGCTACG\n°61,\nWake Forest University\nSchool of Medicine\ngIGANATATCATGCGCA!\nProject 40 - Summer 2026\nGenetic Analysis of Machine Learning-Based Rate of Aging Metrics\nUnderstanding  the  difference  between  biological  aging  and  chronological  aging  is  at  the  crux  of geroscience and our ability to target interventions that reduce disease and improve quality of life for older adults. This project is developing rate of aging (RoA) metrics using machine learning and AI-based tools across a range of non-human primate (NHP) species based on routinely collected clinical data. We will use these RoA to identify shared and species-specific patterns of biological aging across 15,000 NHPs to test if longer lifespans within and between species are associated with increased physiological disruption later in life and a slower pace of biological aging. We will then identify genetic variants that differentiate exceptionally fast and slow agers to characterize pathways mediating health and lifespan differences within and between species. This will leverage existing sequence data in >3,000 NHPs to identify  rare  and  common  genetic  variants  associated  with  lifespan,  healthspan,  and  pace  of  aging within species. This data will be used to identify the underlying biology driving differences in longevity within  and  between  species  which  will  highlight  biological  pathways  for  potential  interventions  in human patients.\nThe student will  gain  experience  in  training and  fine-tuning  neural  network  algorithms, handling large-scale datasets, and performing genetic and bioinformatics analyses. They will also learn how to perform  phylogenetic  analyses  across  nonhuman  primate  species to interpret the evolution  of  longevity  in  humans  and  the translational potential of non-human primate data.\nEllen Quillen, PhD\nAssociate Professor Department of Internal Medicine-Molecular Medicine Center for Precision Medicine Center for Artificial Intelligence Research (CAIR) Wake Forest University School of Medicine http://www.quillenlab.org/\nC\nWake Forest University\nSchool of Medicine\nProject 41 - Summer 2026\nMulti-Modal Fusion of Histopathology and Omics Data for Precision Cancer Diagnosis\nThe goal of this project is to enhance cancer diagnosis by integrating histopathology images and multiomics molecular data, which are publicly available from datasets such as The Cancer Genome Atlas (TCGA).  This  project  will  guide  students  through  the  process  of  analyzing  these  large  and  diverse datasets. Initially, the project will address the processing of gigapixel-sized whole slide images (WSIs), which are essential for assessing the morphological characteristics of cancerous tissues. Due to their enormity and complexity, WSIs  cannot be  analyzed  in  their  entirety  efficiently.  Instead,  they  will  be broken down into smaller, manageable sections known as patches. Each patch will be encoded as a vector,  creating  a  matrix  where  each  column  represents  the  embedding  for  a  patch,  and  the  entire matrix  encapsulates  the  comprehensive  information  of  the  WSI.  To  manage  and  interpret  this  vast amount  of  data  effectively,  linear  algebra  tools  such  as  various  matrix  decompositions  will  be employed to reduce the dimensionality of these matrices. Alongside the imaging data, molecular data from multi-omics sources provides deep insights into the genetic and molecular bases of cancer. This data  includes  detailed  genomic,  transcriptomic,  and  proteomic  information  that,  when  analyzed  in conjunction with WSIs, can reveal comprehensive insights into the biological behavior of tumors. The project  will  explore  how  the  integration  of  these  two  distinct  data  modalities  can  significantly transform patient diagnosis and treatment planning by providing a more nuanced understanding of the disease.\nLearning Objectives: Through this project, students will not only develop technical skills in handling and analyzing large-scale datasets using Python and its associated libraries but also deepen  their  understanding  of  the  statistical challenges in data integration. The knowledge of linear algebra will be applied to real-world scenarios,  enhancing  the students' ability to manage and interpret complex datasets.\nPrerequisites: Students interested in participating in this project should have a basic understanding of statistics and linear algebra. Additionally, proficiency in Python is important for successfully completing the project tasks.\nMostafa Rezapour, PhD\nAssistant Professor Wake Forest Institute for Regenerative Medicine (WFIRM) Center for Artificial Intelligence Research (CAIR) Wake Forest University School of Medicine 486 N. Patterson Avenue\nWinston-Salem, NC 27101\ns for correlating behavioral and microbiological datasets.\nWake Forest University\nSchool of Medicine\nProject 42 - Summer 2026\nannlicatione in animal hahavior analucic\n•AmI\nTAI\nvicion\nComputer Vision Analysis of Maternal Behavior in Vervet Monkeys  for Understanding Early Life Microbiome Transmission\nVervet  monkeys  serve  as  an  excellent  model  system  for  studying  maternal  investment  and  microbiome transmission due to their complex social behaviors, diverse microbiomes, and developmental patterns that are similar to human. Traditional manual coding methods for quantifying maternal behaviors  are timeintensive and subjective. The goal of this project is to develop an automated computer vision pipeline to analyze video recordings of vervet monkey mothers with their infants, quantifying maternal care behaviors and  correlating  these  patterns  with  microbiome  transmission  data.  This  will  provide  insights  into  how specific maternal behaviors influence the establishment of the gut microbiome in early life.\nThe  student  will  gain  hands-on  experience  with  computer  vision  techniques  including  object  detection, tracking algorithms, and pose estimation. They will learn to work with large video datasets, develop skills in  deep  learning  framework  implementation  and  better  understand  the  intersection  of  computational biology  and  animal  behavior  research.  The  student  will  also  develop  experience  in  data  analysis  and statistical methods for correlating behavioral and microbiological datasets.\nThe student will:\nReview literature on computer vision applications in animal behavior analysis\nDevelop and train deep learning models for automated detection and tracking of vervet monkeys in video footage\nImplement behavioral classification algorithms to identify and quantify specific infant care associated behaviors\nAnalyze correlations between automated behavioral measurements and microbiome data to identify key behaviors shaping microbial transmission\nDaniel Sprockett, PhD, MSc\nAssistant Professor, Microbiology and Immunology Wake Forest University School of Medicine Wake Forest Biotech Place 575 Patterson Ave Winston-Salem, NC 27101\nhttps://danielsprockett.github.io/\nMicrobial\nCommunities\nWake Forest University Complex Mixtures of DNA Bacterial Genomes\nSchool of Medicine\nProject 43 - Summer 2026\nAI-Enabled Metagenomic Binning: Integrating Long-Read and ShortRead Data for Improved Microbial Genome Reconstruction\nMetagenomic  sequencing allows researchers to study entire microbial communities directly from environmental samples, providing insights into microbial diversity, function, and interactions. A critical step in  metagenomics analysis is \"binning\" - the process of grouping DNA sequences that originate from the same microbial species to reconstruct individual genomes from complex mixtures. The goal of this project is to  develop  novel  AI-based  approaches  that  integrate  long-read  sequencing  data  with  short-read assemblies to improve the accuracy and completeness of metagenomic binning.\nThe  student  will  gain  experience  with  bioinformatics  data  processing,  including  handling  large-scale sequencing datasets. They will develop skills in advanced machine learning techniques, particularly in multimodal data integration and graph-based neural networks. The project provides exposure to metagenomics  analysis  pipelines  and  microbial  genomics  concepts,  as  well  as  experience  in  method development and computational benchmarking.\nThe student will:\nReview literature on current metagenomic binning methods and hybrid sequencing approaches\nDevelop and implement machine learning models that can integrate long-read and short-read data features\nDesign training and validation frameworks using existing metagenomic datasets with known ground truth\nBenchmark the new hybrid approach against existing state-of-the-art binning tools to demonstrate performance improvements.\nDaniel Sprockett, PhD, MSc\nAssistant Professor, Microbiology and Immunology Wake Forest University School of Medicine Wake Forest Biotech Place 575 Patterson Ave Winston-Salem, NC 27101\nhttps://danielsprockett.github.io/\nle le\nn\nWake Forest University\nSchool of Medicine\nProject 44 - Summer 2026\nExploring Vision and Mobility in BNET-EYE\nOlder  adults  with  poor  vision  are  at  higher  risk  for  falls  and  mobility  disability,  but  the mechanisms linking different aspects of visual function to these adverse outcomes are not wellunderstood.  Moreover,  whether  microstructural  differences  in  the  retina  or  optic  nerve  may explain relationships  between visual  and physical  function  is  not  known.  In  the  Brain  Network and Mobility (BNET)-EYE study, we are measuring performance on the expanded short physical performance  battery  (eSPPB)  and  have  collected  a  portfolio  of  traditional  and  novel  visual function metrics as well as microstructural anatomy of the optic nerve and retina using optical coherence tomography/angiography (OCT/A) in older and younger adults.\nIn  this  project,  the  student  will  1)  learn  about different  tests  of  visual  function  and  2)  learn  to analyze OCT/A microstructural ophthalmic imaging to quantify different anatomical structures  in  the  retina  and  optic  nerve.  This microstructural  data  will  allow  novel  exploration of the relationship between visual function, ophthalmic microstructure, and physical function.\nThe student will develop a hypothesis-driven investigation to analyze whether a specific visual function metric is associated with mobility performance on the eSPPB, and whether ophthalmic microstructural differences may explain this relationship.\nAtalie Thompson, MD, MPH\nAssistant Professor, Dep. of Surgical Ophthalmology\nAssistant Professor, Div. of Gerontology and Geriatric Medicine Wake Forest University School of Medicine https://school.wakehealth.edu/faculty/t/atalie-carina-thompson",
  "tables": [
    {
      "rows": 0,
      "content": "Proj. # | Advisor(s) | 1 | Kristen Beavers & Ashley Weaver | ✓ | 2 | Philip Brown | ✓ | 3 | Philip Brown | ✓ | 4 | Philip Brown | ✓ | 5 | Karan Devane | ✓ | 6 | Karan Devane | ✓ | 7 | Scott Gayzik | ✓ | 8 | Scott Gayzik | ✓ | 9 | Scott Gayzik | ✓ | 10 | Scott Gayzik | ✓ | 11 | Adam Hall | ✓ | ✓ | 12 | Ryan McGinnis | ✓ | ✓ | 13 | Ryan McGinnis & Ellen McGinnis | ✓ | ✓ | 14 | R. McGinnis & E. McGinnis | ✓ | ✓ | 15 | R. McGinnis & E. McGinnis | ✓ | ✓ | 16 | Kristen Nicholson | ✓ | 17 | Joel Stitzel | ✓ | ✓ | 18 | Joel Stitzel | ✓ | 19 | Joel Stitzel | ✓ | ✓ | 20 | Jill Urban | ✓ | ✓ | 21 | Ashley Weaver & Karan Devane | ✓ | ✓ | 22 | Ashley Weaver | ✓ | 23 | Ashley Weaver | ✓ | Standardizing Methods for Virtual Assessment in Human Body Models | 2026 Summer Research Project Descriptions | BME | Informatics | Summer Research Project Titles | Intervening to Mitigate Weight Loss Associated Bone Loss | In-Situ Minimally Invasive Surgical Robotic Bioprinting | Mechanically Matched Patient Specific Bone Surrogates | Full Field Spinal Characterization Methodology Development | Assessment of Pedestrian Crash Protection Systems using Real-World Pedestrian Crash Data in CARLA | Development of Machine Learning Model for Predicting Pedestrian Injuries using Real-World Crash Databases | Human Body Model Development for Trauma Research | Evidence-Based Intervention for Improved Head Impact Safety in Youth Sports | Physics-based Finite Element Analysis for Injury Criteria Using Human Surrogates | Development of Signal Analysis Tools for a National Crash Database | Molecular Detection and Analysis of Trauma Bioindicators | Balance and Mobility Phenotypes of Fall Risk in Persons with Multiple Sclerosis | Digital Health Measures of Postpartum PTSD | Predicting Panic Attacks in the Wild | Detecting Anxiety and Depression in Young Children | Understanding Pitching Efficiency | Crash Injury Research and Engineering Network [CIREN] | Head Impact Exposure Quantification and Mitigation in Motorsports | Subconcussive Head Impact Analysis using Instrumented Mouthpiece Data | Neck & Lumbar Spine Injury Risk Curve Development for Spaceflight Applications | High-Resolution Peripheral Quantitative Computed Tomography (HR-pQCT) Scanning in Clinical Trial Interventions | Muscle Quality/Radiomics Features and Muscle-Bone Crosstalk"
    },
    {
      "rows": 0,
      "content": "Proj. # | Advisor(s) | 24 | Jared Weis | ✓ | 25 | Jared Weis | ✓ | 26 | Jeff Willey | ✓ | 27 | Tanner Filben & Zach Hostetler | ✓ | 28 | Oguz Akbilgic | ✓ | 29 | Nicholette Allred | ✓ | 30 | Metin Gurcan | ✓ | 31 | Metin Gurcan | ✓ | 32 | Metin Gurcan | ✓ | 33 | Metin Gurcan | ✓ | 34 | Metin Gurcan | ✓ | 35 | Ibrahim Karabayir | ✓ | 36 | Da Ma & Michael Horvath | ✓ | 37 | Mohammad Moghimi | ✓ | ✓ | 38 | Mohammad Moghimi | ✓ | ✓ | 39 | Arezoo Movaghar | ✓ | 40 | Ellen Quillen | ✓ | 41 | Mostafa Rezapour | ✓ | 42 | Daniel Sprockett | ✓ | 43 | Daniel Sprockett | ✓ | 44 | Atalie Thompson | ✓ | Exploring Vision and Mobility in BNET-EYE | Predicting Breast Cancer Recurrence From H&E-Stained Whole Slide Images | Nuclei and Tissue Segmentation in Whole Slide Histology Images | Novel Deep learning Algorithms and Explainable AI on ECG | Language-based AI Model on Genomic Data to Understand and Predict risk of Alzheimer Disease and Multimorbidity | Multimodal System for Early Identification of Cardiovascular Diseases | Wearable Flexible Patch for Early Identification of Melanoma | AI-Assisted Pre-screening for Neurological Disorders | Genetic Analysis of Machine Learning-Based Rate of Aging Metrics | Multi-Modal Fusion of Histopathology and Omics Data for Precision Cancer Diagnosis | Computer Vision Analysis of Maternal Behavior in Vervet Monkeys for Understanding Early Life Microbiome Transmission | AI-Enabled Metagenomic Binning: Integrating Long-Read and Short-Read Data for Improved Microbial Genome Reconstruction | Structuring and Standardizing Patient Discharge Notes | Rapid Design and Optimization of Personal Protective Equipment to Mitigate Warfighter Injury Risk | 2026 Summer Research Project Descriptions | Predicting Cancer Treatment-Related Cardiotoxicity by Imaging Cardiac Mechanical Stiffness | Photoacoustic Imaging for Biophysical Physiological Indicators of Infant Intestinal Health and Necrotizing Enterocolitis | The Mouse Housing Unit-8 Mission to the International Space Station: Prevention of Skeletal Complications | Summer Research Project Titles | Medical Image Generation from Physiological Signals | Investigating the Genetic Architecture of the Metabolome to Provide Insight into Cardiometabolic Disease Risk | Anomaly Detection in Lung X-rays | Otoscopy Assistant Diagnosis System with Integrated Classification and Out-of-Distribution Detection | BME | Informatics"
    }
  ],
  "metadata": {
    "email_id": "19aadaf0f535cdc9",
    "attachment_type": ".pdf",
    "original_filename": "19a2beedbec581a4_2026 BME-CAIR Research Project Descriptions.pdf",
    "content_type": "document"
  }
}