{
  "text": "Hi, This is the sample you requested. Please find it attached. Best, A",
  "tables": [],
  "metadata": {
    "id": "19abbcc4a78734e7",
    "from": "Ankita Tripathi <ankitatripathi95@gmail.com>",
    "subject": "[IDLS] sample philosophy of cognitive science paper",
    "date": "Tue, 25 Nov 2025 11:11:58 -0500",
    "eml_path": "data/raw_emails/19abbcc4a78734e7.eml",
    "attachments": [
      {
        "filename": "PHI3323_Paper_2_Tripathi_Ankita.docx",
        "path": "data/attachments/19abbcc4a78734e7_PHI3323_Paper_2_Tripathi_Ankita.docx"
      }
    ],
    "attachment_count": 1
  },
  "attachments_processed": [
    {
      "filename": "PHI3323_Paper_2_Tripathi_Ankita.docx",
      "path": "data/attachments/19abbcc4a78734e7_PHI3323_Paper_2_Tripathi_Ankita.docx",
      "text": "Ankita Tripathi\nPHI 3323\nApril 19, 2020\nPaper 2\nDynamical systems theory (DST) is a viable alternative to the computational-representational understanding of mind (CRUM). A dynamic system is a system that changes over time, and dynamical systems theory provides a practicable alternative to the unchanging nature of the computational-representational framework that is commonly used in cognitive science. Dynamical systems theory assumes the nature of cognition to be dynamic instead of static, thereby filling gaps that the CRUM theory leaves open. Language, like most cognitive phenomena, involves nonrepresentational aspects whose understanding can be supported through dynamic systems, as opposed to unchanging representations. Although criticism of DST claims that cognition cannot be accounted for solely by explaining it as a dynamic system, this is a weak critique, without sufficient evidence to argue in support of the CRUM theory that attempts to explain cognitive processes.\nDynamical systems theory is the mathematics of dynamic systems, that is employed in order to predict, describe, and understand complex phenomena. To understand what a dynamic system is, we must first understand what the words ‘dynamic’ and ‘system’ mean. ‘Dynamic’ describes a property of an entity, that refers to change over time. A ‘system’ is a set of correlated entities, parts, or procedures that collectively form a whole. Therefore, a dynamic system can be considered a collection of processes that changes with time. As time passes, a dynamic system will assume various different states that collectively represent the overall operation of that system.\nA dynamic system that is used to explain a phenomenon is generally understood to be comprised of two parts: qualitative and quantitative. The quantitative aspect of the system describes the variables that influence the instantaneous working of the system and the relationship between these variables. A variable in a system is an aspect of the system that changes over time. For example, the differential equation that is used to explain the “change in arm angle as a function of engine speed” (Van Gelder, p. 356) is the quantitative part of the explanation of the dynamic system that is a Watt governor. If the governor’s operation was paused for a moment, then the aforementioned change in the angle of the arms could be found out by the use of that differential equation. The qualitative aspect on the other hand, enables understanding of the system’s behavior over time. For example, the phase portrait of the motion of a pendulum shows the dynamics of the pendulum and how they temporally repeat in a given space. This explanation of the pendulum’s motion will illustrate a stable pattern in its behavior, wherein the pendulum will tend to approach a particular state from all other states.\nIt is essential for a dynamic system to possess both, quantitative as well as qualitative components, in order to fully understand the system as a whole, because it is not possible to find an analytical solution to the quantitative aspect. An analytical solution for a quantitative entity would mean something like plugging-in a discrete value to solve an equation. This cannot be realized for dynamic systems that are in a state of constant change. A dynamic system can only be understood when all its activity is considered over time, as a whole, thereby requiring a qualitative component as well.\nFinding its origins in physics, dynamical systems theory was primarily employed for modeling and predictive tasks but is increasingly being used in a wider range of applications in fields ranging from economics to neuroscience. While the computational-representational understanding of mind is widely used to explain the basis of cognition within cognitive science, dynamical systems theory provides a practicable alternative to it for the task of understanding the framework of cognition.\nTraditional CRUM posits that cognition is governed through manipulations of internal representations. Essentially, what it claims is that cognition is comprised of internal representations and computations that are performed on those representations, similar in fashion to a machine such as a computer. The drawback with using such a computational-representational structure to represent a cognitive phenomenon is that this structure does not account for time and state change. Dynamical systems can supplement this understanding to extend it to the temporal realm, while also taking into account activities that are fundamentally non-representational in nature. As Van Gelder illustrated, a system’s operation may be understood as algorithmic, with computations being performed on entities that are interdependent, when the system may, in fact, be a non-representational one. The correlation of an entity with a representation may be incorrectly assumed due to a lack of knowledge about alternate ideas. State-space evolutions can thus be easily confused with computations that are performed on representations.\nThere are concepts in dynamical systems theory that explain the relationships between parts of a system with respect to time. These relationships go beyond a static perception and demonstrate how the building blocks of a system are intimately connected. Coupling is one such concept, where the change in one variable affects change in another and vice-versa. Another concept is that of parameters. While a variable is a part of a system that changes with the passage of time, a parameter is an entity that influences change in the system while not being a part of the system itself. A simple representational framework would largely fail to account for these concepts because it is not possible to define such intricate interactions within a system on the basis of representations alone. For example, the relationship between some coupled variables, say a and b, cannot be defined by means of an equation alone as the nonlinearity involved in coupling cannot be represented in a linear manner. We would not be able to describe a complex relationship between these variables without examining their behavior while their state-space evolved over time. A representational framework may even fail to incorporate parameters that would affect a and b.\nAnother way in which dynamic systems excel in explaining cognitive phenomena is the recognition of emergent behavior. Complex behavioral organization is poorly understood via representations, but dynamic systems theory has succeeded to a great degree in unraveling how low-level elementary components come together to create a high-level complex. It is understood and accepted that complex systems comprise of many, many fundamental parts, all of which do not have a linear relationship with one another. For example, physiological phenomena like development, sensorimotor abilities, cognitive phenomena such as learning, all involve complicated communication among processes occurring within different parts in order to achieve one goal. There is no centralized seat of control to facilitate the operation of these systems. There may be external parameters that affect the variables and control their behavior but no singular governing entity.\nIt is implicitly understood that many cognitive processes are fundamentally dynamic in nature. Therefore, dynamic models have successfully been used to interpret, model, and analyze these processes. Mental processes, perception-action, speech-perception, are all activities that are carried out as dynamic systems and there is substantial empirical evidence to support this, as described by Riley and Holden. It is the nature of such processes to be constantly changing and they have been shown to be self-organizing, self-similar and scaling. This further illustrates that the computational-representational understanding as applied to cognitive processes leaves a glaring void in their comprehension, but one that dynamical systems theory readily fills.\nA commonly studied cognitive phenomenon is language. Multiple theories have been put forth to explain language acquisition, processing, and perception in humans, and there has been considerable debate in cognitive science over the validity of these theories. According to the computational-representational understanding of mind, language is understood as a cognitive process by means of internal representations that are manipulated to garner meaning. Traditional CRUM-based cognitive science considers a system’s dependence on knowledge to be facilitated through such symbolic representations and computations. Language is accounted for by means of syntactical structure and grammar-based rule-following. There are numerous issues with this frame of understanding. There may be entities for which no mental models exist. It is not possible to model all abstract concepts by way of representations. Syntactical structure and rule-following do not imply semantic comprehension by a system. As John Searle demonstrated by his famous Chinese room experiment, a machine that can manipulate symbols to produce some output may not itself be cognizant of that output, regardless of whether that output is understood by other individuals. The computational-representational understanding has not been able to successfully model a humanlike cognitive system for language for over 20 years; natural language processing by computers is still in a nascent phase. Further, a CRUM-based theory for language would disregard neurophysiological processes that facilitate language and other cognitive experiences.\nThe problem with using representational-computational frameworks for explaining language as a cognitive phenomenon is that such frameworks are static. While internal representations may be used to supplement variables or parameters of a dynamic system, the processes on these representations are not strictly computational. When analyzing linguistic phenomena like speech patterns, language acquisition, or comprehension, it can be observed that these processes can be mapped to dynamic models. Such processes build on previous states in order to proceed. Therefore, even if the processes themselves may not be predictable, they will be stable. For example, the phase space of speech patterns can be observed over time to be repetitive in nature. The concepts of phase transitions and bi-stability, as they are observed within the context of language, show that it is important to view cognitive processes through the lens of dynamicity. Internal representations that exist just to fulfil a base function are not acceptable entities to model cognitive phenomenon, like language, on and the sole usage of mental structures to explain concepts is insufficient. The ability to perform abstract reasoning and modeling is absent when using a pure computational-representational model for analyzing language-related phenomena. Language is a cognitive phenomenon that is best understood as occurring due to the interconnections between the mind, body, and environment, in a constantly changing state.\nDynamic systems are sets of related components that change over time, much like cognitive systems are known to be. The shortfalls of the computational-representational theory are well-addressed by the use of dynamic systems. Aspects of cognition such as language are better explained as dynamic processes, instead of computational ones. While models of cognition produced by dynamical systems theory may be criticized as being too metaphorical or limited in terms of their ability to account for the factors involved, they are superior to the ones provided by the computational-representational understanding of mind. Thus, in the field of cognitive science, dynamical systems theory is a viable substitute for the computational-representational understanding of mind.",
      "tables": [],
      "metadata": {
        "email_id": "19abbcc4a78734e7",
        "attachment_type": ".docx",
        "original_filename": "PHI3323_Paper_2_Tripathi_Ankita.docx",
        "content_type": "document"
      }
    }
  ]
}