{
  "text": "Hello, The Marcus Autism Center, in conjunction with the Emory University School of Medicine and Children's Healthcare of Atlanta, is offering three fellowships: the ACCESS Fellowship in Implementation Science, the Cohen Fellowship in Developmental Social Neuroscience\r\n and the Simons Fellowship in Computational Neuroscience, Students who will receive a bachelor's degree by June 2026 will be eligible for the positions. The fellowships will commence in July 2026, and they are 2 years in duration. Students can find further details here . Attached, please find a brochure describing the fellowships. Please feel free to print the brochure and post it in your department. I ask that you let us know that you have received this e-mail and that you forward it, along with the associated brochure,\r\n to students in the Department of Computer Science who may be interested in this opportunity. The ACCESS Fellowship in Implementation Science will select fellows for a two-year training in research focused on community engagement participatory methods, translating evidence-based services for autism into community\r\n settings, as well as the processes and partnerships that support these efforts. The Cohen Fellowship in Developmental Social Neuroscience will involve cutting-edge social neuroscience and/or neuroimaging research in infants, toddlers and adolescents. Fellows will work to further the understanding\r\n of autism through eye-tracking research, guiding a project from the point of data collection to publication of results. The Simons Fellowship in Computational Neuroscience will involve integrating computational strategies with clinical research goals. Fellows will develop methods for the analysis of visual scanning and eye-tracking data,\r\n computational models of visual salience, and data visualization techniques, all with the aim of advancing the understanding of autism and efforts at early diagnosis. Thank you for your help! We look forward to hearing from you. Sincerely, Marcus Predoctoral Fellowship Committee Marcus Autism Center, Children's Healthcare of Atlanta, & Emory University School of Medicine Phone: 404-785-9554 Email: marcus.predoc-fellowships@emory.edu",
  "tables": [],
  "metadata": {
    "id": "19afde69be88b77f",
    "from": "Romeo Kumar <kumar@cs.nyu.edu>",
    "subject": "[cs-opportunities] Marcus Autism Center Pre-Doctoral Fellowship Opportunities for Seniors and Recent Graduates",
    "date": "Mon, 8 Dec 2025 07:14:40 -0500",
    "eml_path": "data/raw_emails/19afde69be88b77f.eml",
    "attachments": [
      {
        "filename": "Marcus_Autism_Fellowships.pdf",
        "path": "data/attachments/19afde69be88b77f_Marcus_Autism_Fellowships.pdf"
      }
    ],
    "attachment_count": 1
  },
  "attachments_processed": [
    {
      "filename": "Marcus_Autism_Fellowships.pdf",
      "path": "data/attachments/19afde69be88b77f_Marcus_Autism_Fellowships.pdf",
      "text": "Marcus\nAUTISM CENTER\nFELLOWSHIP OPPORTUNITIES\nADVANCE UNDERSTANDING OF AUTIS M\nPREDOCTORAL FELLOWSHIP OPPORTUNITIES\nOur fellowships\nThe Donald J. Cohen Fellowshipin Developmental Social Neuroscience will select fellows for a two-year training in the study of child development and social neuroscience in autistic children. This includes work in clinical assessment and educational science.\nThe Simons Fellowship in Computational\nNeuroscience will  select  fellows  for  a  two-year training in computer -science and psychology to integrate computational strategies with clinical research goals.\nThe ACCESS Fellowship in Implementation Science will select fellows for a two-year training in research focused on translating evidence-based services for  autism into community settings, as well as the processes and partnerships that support these efforts.\nMarcus Autism Center, in conjunction with ChildrenʼsHealthcare of Atlanta and Emory University School of Medicine, is offering two-year predoctoral research fellowships in three scientific subspecialties. Fellows will participate in innovative researchto provide novel solutionsto complex problems in a robust clinical environment.\nResearchtraining program\nOur research fellowships are intended for college graduates to dedicate two intensive years to research on autism prior to entering graduate studies. Fellows will participate in and guide innovative research while working with  families and autistic children, ranging in age, from week-old infants to adolescents and young adults.\nFellows receive direct research mentorship from the program directors and Marcus Autism  Center faculty members  and are involved in a highly  active and productive community of clinical research scientists. In addition to research training and mentorship, fellows also complete an intensive summer training seminarcovering clinical research in autism (one week), grand rounds  meetings (twice a month), social neuroscience lab meetings (weekly)and ongoing didactic practica. Fellows are strongly  encouraged and expected to submit  their researchfor posters and publications  and will be funded to attend at least one conference a year.\nAll fellowship tracks  are paid two-year positions with full healthcare  coverage. three\nVisit https://med.emory.edu/departments/pediatrics/ divisions/autism/fellow/index.html for more information and to download an application.\n2\nPREDOCTORAL FELLOWSHIP OPPORTUNITIES\nResearchat Marcus Autism Center\nMarcus AutismCenter is the largest center for clinical care of autistic children and their families in the U.S., seeing more than 5,000 patients every year. The center also works in partnership with Emory National Primate Research Center,the\nThese research cores use eye-tracking technology, neuroimaging, modeling and behavioral neuroscience methods to better understand the developmental mechanisms underlying autism , and to develop new tools to improve early detection, diagnosis and service options for autistic children .\nCenters for Disease Control and Prevention (CDC), and Georgia Institute of Technology. These varied institutions enable a multidisciplinary and translational approach to autism research,spanning projects in behavioral neuroscience, neuroimaging,molecular and population genetics, and treatment. The directors of the Fellowship Program lead the social neuroscience, spoken communication, neuroimaging and education sciences research cores within Marcus Autism Center. computational\nApplication information\nSponsor institutions:Marcus Autism Center, ChildrenʼsHealthcare of Atlanta and Emory University School of Medicine\nProgram directors: Warren Jones, PhD; Edwards, PhD; Cheryl Klaiman, PhD; Katherine Pickard, PhD; Aiden Ford, PhD; Hasse Walum, PhD; Alexandra (Sasha) Key, PhD; Jocelyn Kuhn, PhD; Sally Fuhrmeister, MS, CCC-SLP; Jose Paredes, MS; Gordon Ramsay, PhD\n,000 during second year $3 ,000 during first year; $3\nTermof award:\nTwo years\nSubmission deadline:\nTuesday, Jan. 6, 2026\nAward amount:\nAll applications mustbe submitted electronically.The online application portal will open in October 2025.\nTocomplete your online application, you will need a resume or curriculumvitae, a statement of purpose, two letters of recommendation and a scanned transcript(s).\nVisit https://med.emory.edu/departments/pediatrics/divisions/autism/fellow/ index.html or call 404-785-9554 for application materials and additional information.\n3\nDONALD J. COHEN FELLOWSHIP\nIN DEVELOPMENTAL SOCIAL NEUROSCIENCE\nAwarddescription\nThe Donald J. Cohen Fellowship in Developmental Social Neuroscience providesrecent college graduates with the opportunity to spend two years engaged in state-of-theart clinical and basic research wit hautistic  c hildren and  their  families . Cohen Fellows are directly mentored by programdirectors and are involved ina highly active and productive communityof clinical researchscientistswho studyASD. Previous Cohen Fellows have led a wide range of researchprojects and have gone on to PhD, MD and MD/PhD programsin clinical,developmental and basic science specialties.\nDonald J. Cohen (1940-2001) was a nationally and internationally renowned child psychiatrist whose workimproved the lives of children and families all around the world. More informationabout his life and workcan be found here.\nFellowshipexpectations\nCohen Fellows guide a research project from the point of data collection through analysis and publication of results. Over the course of two years, fellows gain indepth research and clinical experience through work with infants,toddlers and school-aged children. Fellows also complete an intensive summertraining seminar covering clinical researchin autism (one week), autism grand rounds(twice a month), statistical seminars (weekly) social neuroscience lab meetings (weekly)and ongoing didactic practica.\nContact the Marcus Predoctoral Fellowship Committee at marcus.predocfellowships@emory.eduor 404-785-9554 with additional questions.\n4\nCorrelation\nASD Eyes\n0.5-\n-0.5\nSIMONS FELLOWSHIP\nIN COMPUTATIONAL NEUROSCIENCE 24\n18\n12,\n15\nTITI\n23456\nAge (in months)\nASD\nAwarddescription\nThe SimonsFellowship in Computational Neuroscience provides recent college graduates with the opportunity to spend two years using  computer programming and basic science to advance our understanding of autism spectrum disorder (ASD). Simons Fellows are directly mentored by program directors and are involved in a highly  active and productive community of clinicians,scientists  and engineers who study autism . Previous Simons Fellows have led a wide range of research  projects and have gone on to PhD, MD and MD/PhD programs,as well as research positions in computer and software engineering.\nFellowshipexpectations\nOver the course of two years,  Simons Fellows work  to integrate computational strategies with clinical research goals, guiding a research project from  data collection through analysis  and publication of results.  Fellows work  on developing methods for analyzing visual scanning and eye-tracking data, computational models of visual salience and data visualization techniques, all with the aim of advancing understanding of autism and efforts at early diagnosis. Fellows also complete a training curriculum through their participation in an intensive summer training seminar covering clinical research in autism (one week), autism grand rounds  (twice a month),social neuroscience lab meetings (weekly) , seminars (weekly), and ongoing didactic practica.\nContact the Marcus Predoctoral Fellowship Committee at marcus.predocfellowships@emory.eduor 404-785-9554 with additional questions.\n5\nACCESS FELLOWSHIP\nIN IMPLEMENTATION SCIENCE\nAwarddescription\nThe ACCESS Fellowship in Implementation Science (ACCESS: Advancing Community Care, Equity, and Sustainability of Services) provides  recent college graduates with the opportunity to spend two years  engaged in innovative  translational research  and to learn about the methods used within implementation science to examine the adoption, implementation and sustainment of evidence-based practices within a variety of community systems,including early intervention and public school systems.\nACCESS Fellows will also  learn about common evidence-based  practices for autism and how these interventions are implemented and adapted across settings in order to meet the needs of caregivers, providers and healthcare systems. This will  include learning how community-partnered, mixed-methods and qualitative research can be used to leverage the voice of autistic  individuals,families and community partners in implementation processes.\nFellows, who are directly mentored by faculty,will gain experience working  alongside key community partners and will  be involved in a highly active and productive community of interdisciplinary research and community partners . This  fellowship aims to serve as a stepping stone for doctoral programs in clinical psychology,for students interested in public health, and  for  Doctor of Psychology and Doctor of Medicine programs.\nFellowshipexpectations\nACCESS Fellows will guide a research project, from data collection through analysis and publication of results. Over two years, fellows will gain in-depth research experience through active engagement in community training and implementation efforts. Fellows also complete an intensive summer training seminar covering clinical research in autism (one week), autism grand rounds meetings (twice a month), implementation science lab meetings (weekly)and ongoing didactic practicum.\nContact the Marcus Predoctoral Fellowship Committee at marcus.predoc- fellowships@emory.eduor 404-785-9554 with additional questions.\n6\n1 0\n©2025 Marcus Autism Center. All rights reserved. MCS 378100.es.11/21",
      "tables": [],
      "metadata": {
        "email_id": "19afde69be88b77f",
        "attachment_type": ".pdf",
        "original_filename": "Marcus_Autism_Fellowships.pdf",
        "content_type": "document"
      }
    }
  ]
}